[{"text": "Find if you would Esther chapter 5, the fifth chapter of the Book of Esther, you know, some might look at the story of Esther and see only a series of coincidences. Well, you know, it's just a coincidence that the king in a drunken stupor would call out to the queen, vashti and insist that she presents herself in front of himself and other drunk man, in a way that we would degrade the office of Queen. And therefore, she said that she would not come and she was eventually deposed because of that action which than open the door for a new Queen. We might look and say well, you know, it's just a coincidence that Mordecai and Esther remained in Susa. It's just a coincidence that Esther would have found favor in the eyes of those to whom she was responsible and", "start_time": 0.0, "end_time": 58.0}, {"text": "But she would eventually find favor in the eyes of the king and be elevated to the role of Queen.", "start_time": 58.7, "end_time": 65.6}, {"text": "Some would say it's just a coincidence that Mordecai. The Jew was", "start_time": 67.3, "end_time": 71.1}, {"text": "In the gate.", "start_time": 72.2, "end_time": 73.6}, {"text": "When he overheard two of the Kings guards, discussing a plot to assassinate the king.", "start_time": 74.6, "end_time": 80.7}, {"text": "Which he was unable to go and tell Esther and Esther told the king and the plot was discovered and stopped sparing the life of a hush where someone say well it was just a coincidence, that Haman was promoted for reasons that are never revealed to us in The Narrative of Esther.", "start_time": 82.1, "end_time": 105.4}, {"text": "But eventually he was put into a position whereby he could convince the king to issue an order calling for the extermination of all the Jews in the Persian Empire.", "start_time": 106.7, "end_time": 117.9}, {"text": "Just a lot of coincidences, it was just a coincidence that ask her then was in position to be able to potentially do something to help.", "start_time": 119.0, "end_time": 128.8}, {"text": "A lot of coincidences.", "start_time": 130.1, "end_time": 131.0}, {"text": "But what if I told you that there are, there really is no such thing as coincidence.", "start_time": 132.8, "end_time": 138.1}, {"text": "What if I told you that you no coincidences, is something that we think of it. It's a term that we think in but coincidence doesn't truly exist, like, we think it does yet. It's part of our lexicon and part of the Lexicon of Our Lives. We constantly talk about coincidences, if you were to go to the store today in and meet somebody that you hadn't seen since you were in high school or in college, he would think well, what a coincidence that we are together in the same store at the same time, walking down the same aisle. And we came together today", "start_time": 140.6, "end_time": 174.5}, {"text": "We think of and we speak in terms of coincidence but there's no such thing as coincidence. What if I told you that there are times when God brings difficulties, that are not coincidental that God brings difficulties and those difficulties serve a greater purpose than you might understand.", "start_time": 176.2, "end_time": 198.7}, {"text": "Look with me and Esther chapter number 5, beginning inverse, number one,", "start_time": 200.2, "end_time": 204.7}, {"text": "On the third day, Esther put on her royal robes and stood in the inner Court of the king's Palace in front of the king's quarters. While the King was sitting on his Royal Throne inside the throne room opposite, the entrance to the Palace. Now you're going to see here in verse number 1, the repetition of the word, Royal she put on her royal robes. He was sitting on his Royal Throne inside the palace. The intent of the author is to paint a picture for us, that these people were not hanging out in some ordinary Place doing something ordinary. This is something extraordinary, this is something outside the realm of what we would consider normal for ourselves that this is situated that this is set in an extraordinary place during an extraordinary time. And we see people who are extraordinary in human perspective but just ordinary creations of God as we look at it from a divine.", "start_time": 207.7, "end_time": 267.1}, {"text": "Perspective. Look at this number to and when the king saw Esther standing in the cord she one favor and his side and he held out to ask her the golden scepter. It was in his hand. Then ask her approached and touch the tip of the scepter and the King said to her. What is it? Queen Esther. What is your request? It shall be given you even to the half of my kingdom and Esther said if it please the king, let the king and ham and come today to a piece that I have prepared for the king. Then the king said bring him and quickly so that we may do is after his asked. So the king and him and came to the feast that Esther is repaired and as they were drinking wine after the feast, the king said to ask her, what is your wish it shall be granted you and what is your request even to have two of my kingdom? It shall be fulfilled.", "start_time": 267.7, "end_time": 314.5}, {"text": "then after answered my wish, in my request is", "start_time": 315.7, "end_time": 319.8}, {"text": "if I have found favor in the sight of the king and if it please the king to Grant my wish and fulfill my request, let the king do is the king of haemon come to the feast that I will prepare for them. And tomorrow, I will do as the king of said,", "start_time": 321.7, "end_time": 337.8}, {"text": "And he even went out that day joyful and glad of heart, but when him and soul Mordecai in the king's gate that he neither Rose nor tremble before him, he was filled with wrath against more than Mordecai.", "start_time": 338.7, "end_time": 351.6}, {"text": "Nevertheless Haman, restrained himself and went home and sent, and brought his friends and his wives are ash and Hammond recounted to them, the Splendor of his riches, the number of his sons all the promotions with which the king and honored him, and how he had Advanced him above the officials and the Servants of the king.", "start_time": 352.7, "end_time": 370.4}, {"text": "Then him and said he even Queen Esther letting no one but me come with the King to the fee, she prepared. And tomorrow also I am invited by her together with the King.", "start_time": 371.5, "end_time": 382.5}, {"text": "Yet, all of this is worth nothing to me.", "start_time": 384.6, "end_time": 386.9}, {"text": "As long as I see, Mordecai the Jew sitting in the king's gate.", "start_time": 387.9, "end_time": 391.2}, {"text": "That is wife's Arash and all his friends said to him, what a Gallows 50 cubits, High be made in the morning. Tell the king that Mordecai. Hang up on it.", "start_time": 392.5, "end_time": 400.6}, {"text": "Then go joyfully with the King to the feast.", "start_time": 401.5, "end_time": 404.5}, {"text": "This idea, please Heyman.", "start_time": 405.2, "end_time": 406.9}, {"text": "And he had the Gallows made.", "start_time": 407.8, "end_time": 409.3}, {"text": "Lord God, you're good to us, in gathering us together, in a place where we can freely.", "start_time": 411.6, "end_time": 416.7}, {"text": "Open your word. Read it. Hear it proclaimed and explained. The father, we know.", "start_time": 417.8, "end_time": 425.2}, {"text": "That we required Divine Aid.", "start_time": 427.0, "end_time": 429.3}, {"text": "Thunder, stand it.", "start_time": 431.1, "end_time": 432.2}, {"text": "And to apply it.", "start_time": 433.3, "end_time": 434.4}, {"text": "So God, I pray that you would give that Aid now.", "start_time": 435.8, "end_time": 438.5}, {"text": "that we would see this not just as", "start_time": 440.2, "end_time": 442.3}, {"text": "a story that took place a long time ago.", "start_time": 443.3, "end_time": 447.5}, {"text": "The land far away.", "start_time": 448.7, "end_time": 449.9}, {"text": "Oh Lord. That we might understand the purpose.", "start_time": 451.6, "end_time": 454.5}, {"text": "For what you have given us to us.", "start_time": 456.4, "end_time": 457.9}, {"text": "And it might impact Our Lives.", "start_time": 459.6, "end_time": 461.4}, {"text": "Lord, I pray that you would enable us to see clearly that which needs to be seen.", "start_time": 462.6, "end_time": 467.8}, {"text": "And understood.", "start_time": 469.3, "end_time": 470.1}, {"text": "And applied For Your Glory.", "start_time": 471.4, "end_time": 472.8}, {"text": "For the greater purpose that you have for our lives as your people.", "start_time": 474.1, "end_time": 477.8}, {"text": "so, father, open our eyes help us to see and understand", "start_time": 478.9, "end_time": 481.9}, {"text": "We pray in Jesus name. Amen.", "start_time": 483.3, "end_time": 485.5}, {"text": "You got often allows difficulties to expose the orientation of your heart.", "start_time": 486.8, "end_time": 491.7}, {"text": "That's one of the things that we see in this text. We see a time in the history of the Jews that was exceedingly difficult.", "start_time": 493.0, "end_time": 499.9}, {"text": "They were, in fact, looking at and facing not just the possibility of Extinction, but the promise of Extinction.", "start_time": 501.1, "end_time": 508.1}, {"text": "For nothing that they had done. Truly this whole thing comes back to the realities of Mordecai, made Haman mad and Haman, instead of just simply trying to deal with the problem by", "start_time": 509.3, "end_time": 522.0}, {"text": "Dealing with one man has said, no, no, no, that's not enough. Someone like me needs to make a bigger Splash and so I'm going to make sure that all of the Jews in the entire Kingdom, pay for what this one man has done. It's a time of great difficulty and I know that we typically speak in the language of coincidence, but c.s. Lewis, attributed is attributed, to a said, coincidence is God's way of remaining anonymous.", "start_time": 523.5, "end_time": 549.7}, {"text": "You know, God's name is not mentioned throughout this book. And yet we see that God is on every page that God is the one who is moving all of the pieces that God, is the one who is friendly and carefully behind the scene orchestrating Every Act to bring about his greater purpose. He is orchestrating every move to to do that when she is determined to do to deliver his people from Annihilation, and thereby fulfill, the promise that may he made to Abraham to Isaac to Jacob.", "start_time": 551.3, "end_time": 584.4}, {"text": "And our Sovereign, God the same God who is working behind the scenes in the story of Esther, that's the same. God is just a sovereign today, as he was when this event was taking place that same. It's just a sovereign today as he is ever been. He is suffering, he remained Sovereign and he will often don't miss this, he will often allow difficulties to assail you", "start_time": 586.2, "end_time": 609.7}, {"text": "Because he wants to expose you to the orientation of your heart, he wants to pull back the curtain so that you can see how your heart is oriented. And one of the ways he does, that is by bringing us into difficult situations.", "start_time": 610.7, "end_time": 630.1}, {"text": "And scenarios.", "start_time": 632.5, "end_time": 633.5}, {"text": "Human perspective. We don't like the sovereignty of God.", "start_time": 636.0, "end_time": 641.4}, {"text": "And let me tell you why we don't like the sovereignty of God, because if God is Sovereign, that means we're not.", "start_time": 642.6, "end_time": 649.2}, {"text": "Right.", "start_time": 650.7, "end_time": 651.1}, {"text": "And we don't like the idea of someone other than ourselves being in control.", "start_time": 652.2, "end_time": 659.6}, {"text": "I don't like to ride with anybody in a car.", "start_time": 661.3, "end_time": 663.8}, {"text": "I'm serious. I don't know when my kids were learning how to drive scared the fire out of me. Why? Because I'm not the one behind the wheel. Therefore, I didn't teach them how to drive. I let Rebecca do it and", "start_time": 664.7, "end_time": 675.9}, {"text": "I would ride with him right before they took the test.", "start_time": 679.1, "end_time": 681.4}, {"text": "I I, I like to feel", "start_time": 683.3, "end_time": 686.4}, {"text": "as though I'm in control.", "start_time": 687.8, "end_time": 689.2}, {"text": "And when I'm reminded from the truth of God's word that I am not in control in any way.", "start_time": 690.7, "end_time": 696.4}, {"text": "It doesn't sit well with me.", "start_time": 697.5, "end_time": 699.3}, {"text": "Just a minute ago, you all saying to the top of your lungs we will trust in you.", "start_time": 702.7, "end_time": 710.0}, {"text": "Perfect. Savior, strong Defender, we will trust in you. You know what? It's really, really, really easy to sing. Those words, isn't it?", "start_time": 711.9, "end_time": 721.2}, {"text": "It's an entirely different thing. When we are put into a situation whereby we must actually trust him.", "start_time": 724.5, "end_time": 732.3}, {"text": "When we realize that we truly have no control whatsoever. And the only thing that we can do,", "start_time": 734.0, "end_time": 742.3}, {"text": "Is the step back and say, okay God, I have to trust you.", "start_time": 743.9, "end_time": 747.0}, {"text": "With my child.", "start_time": 748.5, "end_time": 749.6}, {"text": "I have to trust you with my spouse. I have to trust you with my finances. I have to trust you with fill in the blank.", "start_time": 751.4, "end_time": 757.6}, {"text": "Oh, standing among of a great group of Believers, listening to beautiful music being played by the band and singing out we will trust in you. That is so easy. But when you actually have to do what you have to acknowledge the truth, that God is The Sovereign one and that you are not in because we don't like the sovereignty of God, we begin to look at things and and the things that people do specifically in the things that happened in the world around us in. And we begin to declare that the God can't be Sovereign in the way that scripture Define sovereignty and declares sovereignty. Why? Because if God is Sovereign, then why are all these terrible things happening around us? Why do we see so many sinful things playing out on the stage in front of us? If God is, truly Sovereign, has control of everything. Then surely, he could stop these bad things from happening.", "start_time": 758.5, "end_time": 809.5}, {"text": "Listen, God's sovereignty and human responsibility or not in competition against one another.", "start_time": 813.7, "end_time": 818.3}, {"text": "The men and women in the story.", "start_time": 821.9, "end_time": 824.2}, {"text": "They were not being controlled.", "start_time": 825.6, "end_time": 828.9}, {"text": "As passive.", "start_time": 830.9, "end_time": 833.4}, {"text": "Figures.", "start_time": 834.9, "end_time": 835.6}, {"text": "When I was a kid, I I loved GI Joe and Transformers.", "start_time": 837.3, "end_time": 842.0}, {"text": "I would get home from school.", "start_time": 843.0, "end_time": 845.1}, {"text": "And I would watch really three cartoons Scooby-Doo.", "start_time": 846.3, "end_time": 850.8}, {"text": "Amen. Right. I may not get another amen. The rest of the time from some of you but I said Scooby-Doo and you're like preach it brother.", "start_time": 852.9, "end_time": 859.0}, {"text": "Transformers.", "start_time": 862.1, "end_time": 863.2}, {"text": "In g.i., Joe.", "start_time": 864.2, "end_time": 864.9}, {"text": "And I would get GI Joe toys and transfer Transformer toys, at for Christmas, and for my birthday, and I would play with those toys. The crazy thing about it is", "start_time": 866.6, "end_time": 878.9}, {"text": "Then why I laid those toys down on the ground? They didn't pick themselves up and position themselves in battle, ready positions, right? Toy Story is fake just a cartoon. They don't really do that.", "start_time": 880.3, "end_time": 893.9}, {"text": "And if I I left them on the ground and walked away. Then when I came back, they would be right where they were in the position in which I left him, I had to act upon them, I had to move their arms and their legs, in their head. I had to transform Optimus from semi mode to robot mode. I had to do that, and we sit there and think that the sovereignty of God is much like that, God is pulling all the strings that we're just animatronics and and a, we're puppets and and we are moved into position and and we do things just according to the way he wants them to be done. And that is a simplistic view of the sovereignty of God.", "start_time": 895.9, "end_time": 933.0}, {"text": "We see here that God is is behind everything that is taking place and that God is orchestrating, everything that is taking place, every move. That is made every step that is taken. That sounds like that song, right? Every move you make every step you take", "start_time": 935.5, "end_time": 949.3}, {"text": "I don't know why I went there but it just in my head.", "start_time": 952.0, "end_time": 954.4}, {"text": "We think that okay, he did this and he did that until God calls this and God did this. And listen, God is behind everything that is going on, but he is also working through", "start_time": 957.4, "end_time": 967.8}, {"text": "The actions of the people involved in the narrative.", "start_time": 969.7, "end_time": 973.4}, {"text": "These people were not compelled to act, contrary to their Wills, but God work through their actions to accomplish his purposes. Peter describe this for us. When he preached on Pentecost, talk to you about a price. He said this Jesus delivered up according to the definite plan and foreknowledge of God you crucified and killed by the hands of Lawless men.", "start_time": 974.9, "end_time": 996.4}, {"text": "It was God's purpose for Christ to come in to live and to die on the cross. This was set in motion before the very foundation of the world but yet God use the sinful actions of human beings as the tools whereby what God had willed to happen actually took place.", "start_time": 997.7, "end_time": 1017.3}, {"text": "Make sense.", "start_time": 1018.8, "end_time": 1019.6}, {"text": "That's what we see Happening Here.", "start_time": 1020.8, "end_time": 1022.4}, {"text": "God is behind the scenes, God and purposes. What is going to take place? And yet he uses the actions, the good. And even the simple actions of the people involved to accomplish that purpose. One author, said. Achieves his perfect gold not just through our best intentions and most self-sacrificing acts, but even through our greatest sins and compromises,", "start_time": 1023.6, "end_time": 1047.4}, {"text": "I maybe that's not something that brings Comfort to you, but as a center that brings real Comfort to me,", "start_time": 1049.3, "end_time": 1054.2}, {"text": "I'm glad to know that my sinful acts don't derail the plan and purpose of God.", "start_time": 1055.9, "end_time": 1060.6}, {"text": "But God is so great and so powerful. And so, Sovereign that he can take, even the sinful things that I do and turn them, and use those to accomplish his purpose and Glory.", "start_time": 1062.3, "end_time": 1074.2}, {"text": "And sometimes because of our actions and sometimes because of nothing that we've done God, who is Sovereign in control of all things brings difficulties, but God sees to it. And here's what, I don't want you to miss God's sees to it that for his people, the purpose of those difficulties is never ever wasted another word. We don't just go through hard times to go through hard times.", "start_time": 1076.8, "end_time": 1103.8}, {"text": "God is not some sadistic vindictive being who is up there thinking, you know what, how can I make them suffer? How can I make life difficult? Just because I can", "start_time": 1105.5, "end_time": 1117.8}, {"text": "No, for the believer. Every single thing helps to accomplish the purpose of God in us.", "start_time": 1119.5, "end_time": 1126.4}, {"text": "End of the world.", "start_time": 1128.2, "end_time": 1129.1}, {"text": "So what do the difficulties of Life accomplished? How how did difficulties expose the the orientation of the Hartwell?", "start_time": 1130.9, "end_time": 1138.4}, {"text": "This story does not provide for us and exhaustive list of the ways.", "start_time": 1139.9, "end_time": 1144.5}, {"text": "That God uses difficulties to accomplish things in our life. But there are two conclusions that we can draw from the difficulties presented in this chapter. The first is this that Esther when difficulty came became selfless,", "start_time": 1145.7, "end_time": 1160.3}, {"text": "Know, the author shows us in chapter 5. The Esther we've come to know from chapter to do. If you remember the flow of the story. Esther was not seeing in chapter one. She comes into the, onto the scene, in Chapter 2 where to buy, she's elevated to the role and office of Queen. She's not seen again in chapter number 3, she enters the scene a second time in chapter 4 and then the first part of the narrative in chapter 5 is really focused on this woman Esther and some of the things that we see in chapter five are the same things that we saw about her in chapter 2.", "start_time": 1162.1, "end_time": 1204.9}, {"text": "So we see essentially the same person, however, we see the same person who is now using, who she is not for her own selfish ends.", "start_time": 1205.8, "end_time": 1215.8}, {"text": "But for a selfless purpose.", "start_time": 1216.8, "end_time": 1219.3}, {"text": "So just to bring you up to speed on what's going on here, at the end of chapter, number for Esther had learned, the plan of Haman. He should learn the edict that had been sent out throughout the kingdom that all of the Jews were going to be annihilated that all of the Jews were we're going to be killed and the destruction was complete.", "start_time": 1220.7, "end_time": 1241.4}, {"text": "That it was exhausted that if this plan was carried out, not one single Jew would be alive and the entire Persian Kingdom.", "start_time": 1242.9, "end_time": 1252.7}, {"text": "She had no idea that that was even a thing. She was just living in the walls of the palace going on, about her luxurious life. And then she heard from Mordechai. That this thing had happened and her initial reaction. If you remember was in essence, wow, that sounds really, really bad. Sorry,", "start_time": 1253.7, "end_time": 1273.5}, {"text": "If I go to the king and try to talk to the king about this unannounced, I could lose my own life.", "start_time": 1275.7, "end_time": 1281.2}, {"text": "that's not really part of my plan and so,", "start_time": 1282.4, "end_time": 1285.9}, {"text": "Good luck.", "start_time": 1287.8, "end_time": 1288.5}, {"text": "That's essentially what we see in chapter 4.", "start_time": 1290.6, "end_time": 1293.4}, {"text": "and then,", "start_time": 1294.4, "end_time": 1295.4}, {"text": "Mordecai. Send another message to her and the other message is this? Okay, Esther.", "start_time": 1296.4, "end_time": 1301.7}, {"text": "You know what you think you're safe in The Palace. They know you were a Jew now and and it's so you're not actually safe there anymore than what we are outside of the palace but but we know that Deliverance for the Jews is going to come from some other place. You and your father's house are going to die but maybe, just maybe who knows is the language given to us in chapter 4, who knows? If you have attained this position in the Kingdom for such a time as this for this purpose,", "start_time": 1302.7, "end_time": 1334.9}, {"text": "To do something.", "start_time": 1337.2, "end_time": 1338.4}, {"text": "About the situation.", "start_time": 1340.6, "end_time": 1341.7}, {"text": "And to that Esther responded. Okay, we're going too fast for 3 Days. Myself in my maids and tell all of the Jewish people too fast for 3 days and then I will go in and break the law and see the king.", "start_time": 1344.1, "end_time": 1358.7}, {"text": "And if I perish, I perish.", "start_time": 1360.0, "end_time": 1361.2}, {"text": "I might lose my life for this, and if I do at least, I died for something doing something, instead of doing nothing.", "start_time": 1364.0, "end_time": 1370.4}, {"text": "So we come to chapter 5.", "start_time": 1374.1, "end_time": 1375.9}, {"text": "And we see.", "start_time": 1379.1, "end_time": 1380.0}, {"text": "Some really laudable characteristics of Esther that she employed in chapter 2.", "start_time": 1381.8, "end_time": 1387.2}, {"text": "22.", "start_time": 1388.3, "end_time": 1389.1}, {"text": "Ascend to the throne.", "start_time": 1390.5, "end_time": 1391.6}, {"text": "And now she's using them for a greater higher purpose. Notice what it says about her on the third day,", "start_time": 1393.4, "end_time": 1398.3}, {"text": "will it tell us a tell us that Esther was prepared?", "start_time": 1400.1, "end_time": 1402.5}, {"text": "It tells us that she took the responsibility of of going before the king to present the petition to save the people. Very seriously so much so that she fasted for 3 days. Now, some people like to say that prayer is implied in the fasting, but the narrative, the text doesn't actually say that prayer is took place, the prayer happened and so we're just going to act like because it's not in the text. It's not really something that should guide our thinking, maybe she prayed, we don't know, we do know that she fasted and that fasting was most likely a time to prepare yourself physically mentally and maybe even spiritually.", "start_time": 1403.7, "end_time": 1441.8}, {"text": "To take a huge risk.", "start_time": 1443.7, "end_time": 1444.8}, {"text": "To go before the king without being invited.", "start_time": 1448.1, "end_time": 1451.0}, {"text": "And so she prepared herself much, like she prepared herself to go into the king. The first time in chapter number two, she was prepared. Notice what else you put on Royal robes?", "start_time": 1453.4, "end_time": 1463.6}, {"text": "She was thoughtful.", "start_time": 1466.1, "end_time": 1467.1}, {"text": "She understood that if you know what, I'm not going to Walmart in my pajamas and Crocs.", "start_time": 1468.8, "end_time": 1473.2}, {"text": "Why do people go to Walmart in pajamas? And I don't understand that. If anybody can explain that to me, I would maybe like to hear that maybe not, I don't know.", "start_time": 1475.4, "end_time": 1484.5}, {"text": "What she said that. She knew that she had a serious responsibility. A serious job. So what did she do? She put on the Robes of royalty.", "start_time": 1486.8, "end_time": 1496.6}, {"text": "She put on her queenly, garments.", "start_time": 1499.7, "end_time": 1502.1}, {"text": "The finest.", "start_time": 1503.7, "end_time": 1504.7}, {"text": "In the Kingdom.", "start_time": 1505.8, "end_time": 1506.5}, {"text": "She put the crown on her head.", "start_time": 1508.4, "end_time": 1510.1}, {"text": "She prepared herself to gain an audience with the King.", "start_time": 1511.8, "end_time": 1516.7}, {"text": "Something to be said about preparation.", "start_time": 1519.2, "end_time": 1520.8}, {"text": "She prepared. And she was thoughtful much like she was in Chapter 2 when she said, what is it? That the king likes?", "start_time": 1523.0, "end_time": 1529.6}, {"text": "What is it that I can do?", "start_time": 1531.4, "end_time": 1532.6}, {"text": "Then we see.", "start_time": 1535.3, "end_time": 1536.2}, {"text": "But she stood in the inner Court.", "start_time": 1537.5, "end_time": 1539.0}, {"text": "And that she waited.", "start_time": 1541.1, "end_time": 1543.8}, {"text": "To be acknowledged.", "start_time": 1545.1, "end_time": 1546.2}, {"text": "No, she clearly didn't go into the throne room because had she gone into the throne room. The King, this is verified by historical documents. The king would have had behind him. A couple of guys. One maybe two wielding axes and so she just rushed right into the throne room. One of those guys would have just poop.", "start_time": 1547.1, "end_time": 1565.5}, {"text": "And taking off her head.", "start_time": 1567.4, "end_time": 1568.7}, {"text": "No one was allowed to go into the king's presence without being invited first. So what did she do?", "start_time": 1570.9, "end_time": 1577.4}, {"text": "Instead of thinking that she because she's the queen, had a right to do what nobody else could do know, she, she got to where she was within his line of sight and maybe I don't know. This is speculation. Perhaps the light hit a jewel, in her crown, in such a way, or a jewel that she was wearing in such a way that the light refracted off of that and and caught the king's eye. And he turned his attention to see her. And, and when he saw her, what did he do? He held out the scepter,", "start_time": 1578.7, "end_time": 1605.0}, {"text": "Which then allowed her to come into His presence, and she came in and she did so not rushing into his presence, not with bravado, not with any kind of arrogance. But she came humbly", "start_time": 1606.1, "end_time": 1619.0}, {"text": "And she touched the scepter.", "start_time": 1620.6, "end_time": 1622.0}, {"text": "and she said,", "start_time": 1625.6, "end_time": 1626.5}, {"text": "if it please the king.", "start_time": 1628.6, "end_time": 1629.9}, {"text": "She understood her role. She understood her position.", "start_time": 1632.5, "end_time": 1634.9}, {"text": "and she exercised,", "start_time": 1636.5, "end_time": 1639.0}, {"text": "great humility.", "start_time": 1639.9, "end_time": 1641.0}, {"text": "And then she went to work.", "start_time": 1643.5, "end_time": 1644.6}, {"text": "And what we see in the rest of this half of the narrative is really Esther, executing a plan that she had thought through very well.", "start_time": 1647.0, "end_time": 1657.2}, {"text": "She was skillful in what she did and how she did it. She said, if it please the king, let the king and Haman.", "start_time": 1659.0, "end_time": 1669.1}, {"text": "Why not just the king?", "start_time": 1670.1, "end_time": 1671.4}, {"text": "Whitehaven to", "start_time": 1672.4, "end_time": 1673.4}, {"text": "cuz she knows what she's doing.", "start_time": 1675.6, "end_time": 1676.7}, {"text": "What are things that we can tell about Esther from The Narrative? Isn't she evidently had a propensity inability to read people?", "start_time": 1678.0, "end_time": 1684.1}, {"text": "And she knew how to put people into places so that the maximum effect and benefit would would take place meeting with the key alone. Wasn't the gold. Know she wanted Heyman to be there as well. And so she says come to the feast today that I have prepared for you. The king", "start_time": 1685.7, "end_time": 1705.3}, {"text": "So the kingdom calls out, Bring Heyman.", "start_time": 1706.6, "end_time": 1711.3}, {"text": "He's got to come so we can go together quickly to meet with the queen and have dinner and so they had dinner and then they were drinking. And then the king says to Esther a second time, what is it that you want? So this tells us that the king knew when I understood that Esther wanted something, it wasn't that she just wanted to prepare a meal for him. She wanted something he knew that, and he's a pretty ignorant, foolish guy, but he was able to pick up on this", "start_time": 1712.2, "end_time": 1738.0}, {"text": "So, she must have been dropping some pretty hefty hints.", "start_time": 1739.5, "end_time": 1743.1}, {"text": "What is your wish?", "start_time": 1745.8, "end_time": 1746.7}, {"text": "It shall be. Granted you, what is your request even to half my kingdom? It shall be fulfilled.", "start_time": 1747.8, "end_time": 1755.0}, {"text": "Now half my kingdom was hyperbole, he wasn't planning on giving up half the kingdom. What he was telling Esther is this? I have the power to give you what you're asked, what you ask for trust me.", "start_time": 1758.1, "end_time": 1769.1}, {"text": "All you have to do is ask.", "start_time": 1770.5, "end_time": 1771.8}, {"text": "What is it that you want?", "start_time": 1773.3, "end_time": 1774.4}, {"text": "So,", "start_time": 1779.5, "end_time": 1780.0}, {"text": "she continues.", "start_time": 1781.5, "end_time": 1782.5}, {"text": "My wish and my request is now.", "start_time": 1784.2, "end_time": 1786.2}, {"text": "In the Hebrew. It it seems as old almost if there should be an ellipsis here...", "start_time": 1787.7, "end_time": 1794.3}, {"text": "There's a parts. My wish is", "start_time": 1795.5, "end_time": 1798.6}, {"text": "some people speculate that she lost her nerve here.", "start_time": 1800.3, "end_time": 1803.1}, {"text": "Does she was fully planning on saying, listen Haman has convinced you to kill all of my people. I need you to resend that order.", "start_time": 1804.3, "end_time": 1812.3}, {"text": "But I don't think that's what's going on here.", "start_time": 1815.6, "end_time": 1817.3}, {"text": "I think what's happening is", "start_time": 1819.9, "end_time": 1821.4}, {"text": "She skillfully fishing.", "start_time": 1823.1, "end_time": 1825.7}, {"text": "Play explained.", "start_time": 1827.8, "end_time": 1828.7}, {"text": "She's put, the, the bait on the hook, she's cast the lower out into the water and, and she's pulling it in. And, and maybe just as the king gets a little bit close, she Yanks it a little bit and peeks, the king's interest just a little bit more and", "start_time": 1830.0, "end_time": 1845.5}, {"text": "And then she starts reeling it in more and, and the king is coming closer and closer in, and he's just about ready to take a nibble. And she Yanks it again and she's trying to set it just in the right position. So at the right time, the king B,", "start_time": 1846.6, "end_time": 1862.3}, {"text": "and then,", "start_time": 1867.1, "end_time": 1867.9}, {"text": "She can make a request. Know she says as much here, she says listen come to a feast tomorrow.", "start_time": 1868.8, "end_time": 1873.5}, {"text": "That I'm going to prepare for them, not notice something.", "start_time": 1874.9, "end_time": 1878.6}, {"text": "Inverse number for, she said, I prepared A Feast for the king.", "start_time": 1880.1, "end_time": 1883.2}, {"text": "Put down and verse number eight. She says that she's prepared to The Feast for she will prepare the Feast for them, the king and Hayman Hayman is like wow.", "start_time": 1885.5, "end_time": 1895.0}, {"text": "You're preparing A Feast for me.", "start_time": 1896.3, "end_time": 1897.7}, {"text": "and then she says this,", "start_time": 1899.3, "end_time": 1900.5}, {"text": "Tomorrow.", "start_time": 1901.8, "end_time": 1902.6}, {"text": "I will do as the king of sin.", "start_time": 1904.2, "end_time": 1905.6}, {"text": "I'll tell you tomorrow.", "start_time": 1908.0, "end_time": 1908.7}, {"text": "What did you have to understand? Here is this is a, this is a complex issue.", "start_time": 1911.0, "end_time": 1915.0}, {"text": "And it's a risky issue. What she's asking the king. What she will ask the king to do is no small thing. That's why I believe she did just barge right in and just black right out, right?", "start_time": 1916.4, "end_time": 1926.4}, {"text": "She was.", "start_time": 1927.8, "end_time": 1928.7}, {"text": "Skillfully working the problem.", "start_time": 1929.6, "end_time": 1931.9}, {"text": "To achieve the desired end.", "start_time": 1933.3, "end_time": 1935.3}, {"text": "The story is told of Alexander the Great who marched his army into turkey and he was showing the knot of gordius.", "start_time": 1936.5, "end_time": 1943.7}, {"text": "And the knot of gordius was a knot that was so huge and so complex that it was humanly impossible anti but the legend was any man who could successfully untie the knot would rule over all of Asia.", "start_time": 1945.7, "end_time": 1958.2}, {"text": "So when Alexander the Great and his troops marched into turkey, he was introduced to and presented the knot of gordia since he was told the story. And so he began to mess with the not. The story goes for a few minutes, became frustrated. Everybody was watching him. Fail it in time this not any essentially thought you know what it doesn't say how it needs to be untied and took his sword and hacked, and not two pieces, so that it fell apart right in front of everybody.", "start_time": 1959.3, "end_time": 1983.5}, {"text": "Esther, could not take such a simplistic approach. Why? Because it was something called The Law of the medes and Persians. The law of the major needs in the Persians was irrevocable when a Persian king set for a law that wall could not be rescinded, even by the king's own order.", "start_time": 1985.8, "end_time": 2002.1}, {"text": "Daniel was familiar with this. Why? Because when Darius the Persian king enacted, a law said, no one can pray to anybody, but you for the next 30 days and Daniel did it the king regrettably threw Daniel into the lion's den? Why? Because he had to follow his own law,", "start_time": 2003.3, "end_time": 2020.8}, {"text": "And for a Persian king to fail to follow his own wall would be a self admitting failure that he himself did not have the strength, the power of the force to execute his own word. And so Esther coming along saying listen you need to write off this law so that the Jews aren't killed. It would have made the king unbelievably bad.", "start_time": 2022.5, "end_time": 2048.9}, {"text": "Feckless powerless in front of his people.", "start_time": 2050.4, "end_time": 2053.2}, {"text": "So ask her needed to to, to manufacture to do things in such a way, that would be very very hard for the king to wiggle out of a promise that he's made.", "start_time": 2055.0, "end_time": 2065.4}, {"text": "So, follow along.", "start_time": 2066.9, "end_time": 2068.0}, {"text": "Esther, what is your wish?", "start_time": 2069.6, "end_time": 2070.9}, {"text": "You will have it.", "start_time": 2072.3, "end_time": 2073.2}, {"text": "Esther, what is your wish?", "start_time": 2074.7, "end_time": 2076.3}, {"text": "You will have it up to half of my kingdom.", "start_time": 2077.4, "end_time": 2079.1}, {"text": "Tomorrow I'll tell you king Esther. What is your wish three times, the king will have promised to give Esther what she's looking for. Esther is a smart girl.", "start_time": 2080.3, "end_time": 2093.4}, {"text": "She knows what she's doing. She's putting the king into a position where it would be almost impossible for him to deny her request.", "start_time": 2096.3, "end_time": 2104.9}, {"text": "I shall we see Esther.", "start_time": 2110.2, "end_time": 2112.8}, {"text": "Many of the same traits on display in chapter 5.", "start_time": 2114.0, "end_time": 2116.4}, {"text": "With which she won favor. In the eyes of all, who saw her in Chapter 2, it eventually won the grace and favor of the king. These things are once again on display. She's prepared. She's thoughtful, she's humble. She skillfully executing a plan only this time.", "start_time": 2117.9, "end_time": 2131.5}, {"text": "She worked to help others. Instead of herself.", "start_time": 2133.6, "end_time": 2136.6}, {"text": "That leads to a question. What changed this woman?", "start_time": 2139.2, "end_time": 2141.3}, {"text": "How did she move from only being concerned about herself in Chapter 2 win against in chapter number 42? Actually risking her own life. A very real risk to to put in Action. A plan to save others.", "start_time": 2143.3, "end_time": 2155.8}, {"text": "or perhaps, she came to realize that that she was the one", "start_time": 2156.9, "end_time": 2160.3}, {"text": "who is to stand in the Gap and do what? No one else was in position to do know, if God did not need Ester.", "start_time": 2161.8, "end_time": 2168.2}, {"text": "Esther had been elevated to this place at this time.", "start_time": 2169.3, "end_time": 2172.9}, {"text": "For this purpose.", "start_time": 2174.2, "end_time": 2174.9}, {"text": "So eventually she put the needs of others before.", "start_time": 2178.3, "end_time": 2180.8}, {"text": "Herself.", "start_time": 2182.8, "end_time": 2183.5}, {"text": "and some people believe that the tester is a type of Christ, I don't necessarily Embrace that typology but I do think that there is initially a contrast", "start_time": 2185.1, "end_time": 2197.0}, {"text": "Between Esther in Jesus and that Esther initially was like, no, I'm not willing to get involved with Jesus.", "start_time": 2198.3, "end_time": 2205.1}, {"text": "Came to be involved.", "start_time": 2206.5, "end_time": 2207.9}, {"text": "But he came to seek and save, that was, who are lost that, that Jesus is the one who came not for his own purpose, and not for his own Glory, but he came to do, the will of the father and the Book of Philippians tells us that Jesus obey the will of the father and became obedient to the place of death, or the point of death, even death on the cross. And earlier, in the text Paul says that brothers and sisters are to deal with each other. In the same way in the church that we are to have the same mind in us. And what is that? Mine said that we think not only of ourselves but we think of the needs of other people and we placed their needs ahead of our own. Therefore, we live, and we serve God by serving others.", "start_time": 2209.3, "end_time": 2250.7}, {"text": "And that's just what we see than Esther doing.", "start_time": 2252.8, "end_time": 2255.5}, {"text": "After she was initially selfish in her response, she became selfless. And she realized that the needs of others far superseded in her own need, to try to stay safe in the Kingdom.", "start_time": 2257.2, "end_time": 2269.1}, {"text": "So it's not about me anymore, it's about others. It's about putting my life on the line for others and I'm so thankful that I can stand up here today and I can tell you the Jesus Christ, put his life on the line for us. When death was certain, he gave himself on the cross, not because he needed to die for anything that he had done, but he should die. So that we can be saved. He died in our place and for our sin.", "start_time": 2270.6, "end_time": 2296.6}, {"text": "There's something else we need to see about Esther.", "start_time": 2300.3, "end_time": 2302.3}, {"text": "and it is this that", "start_time": 2304.0, "end_time": 2305.1}, {"text": "history shows us that God gives us ability and intends that we use those abilities first purpose.", "start_time": 2306.4, "end_time": 2312.9}, {"text": "Just think through this text with me again.", "start_time": 2314.7, "end_time": 2317.9}, {"text": "God is the one.", "start_time": 2320.4, "end_time": 2321.3}, {"text": "Who made extra beautiful.", "start_time": 2322.8, "end_time": 2324.0}, {"text": "God is the one who gave Esther the personality that he gave her.", "start_time": 2326.2, "end_time": 2330.5}, {"text": "God is the one who allowed.", "start_time": 2332.0, "end_time": 2334.8}, {"text": "Mordecai to hear the plan.", "start_time": 2336.1, "end_time": 2338.5}, {"text": "Of the assassins.", "start_time": 2339.8, "end_time": 2341.1}, {"text": "God is the one who here.", "start_time": 2342.9, "end_time": 2344.9}, {"text": "Move the king to show favor to Esther so that Esther could come forward.", "start_time": 2346.5, "end_time": 2351.6}, {"text": "And then she use the personality.", "start_time": 2353.9, "end_time": 2356.0}, {"text": "And the character traits that God had given her.", "start_time": 2357.5, "end_time": 2360.1}, {"text": "For God's purpose, not around.", "start_time": 2362.8, "end_time": 2364.3}, {"text": "Let me ask you.", "start_time": 2367.9, "end_time": 2368.7}, {"text": "Has God Made You skillful.", "start_time": 2370.2, "end_time": 2371.9}, {"text": "With anyting.", "start_time": 2374.0, "end_time": 2374.8}, {"text": "Maybe your skillful and Landscaping. Maybe your skillful in computer code. Maybe your skillful and woodworking, maybe your skillful in housecleaning. Maybe your skillful in school. Whatever God has made useful.", "start_time": 2378.2, "end_time": 2393.9}, {"text": "Has God.", "start_time": 2398.3, "end_time": 2399.0}, {"text": "Giving you a great mind.", "start_time": 2400.6, "end_time": 2402.2}, {"text": "He's giving you intelligence.", "start_time": 2405.4, "end_time": 2406.8}, {"text": "Has God given you a personality that attracts people?", "start_time": 2408.9, "end_time": 2411.7}, {"text": "I don't have that personality, but some of you do,", "start_time": 2413.2, "end_time": 2415.7}, {"text": "Has God given you strength?", "start_time": 2419.6, "end_time": 2421.1}, {"text": "And internal fortitude.", "start_time": 2423.0, "end_time": 2424.2}, {"text": "A strong will.", "start_time": 2426.8, "end_time": 2428.4}, {"text": "Spine of Steel.", "start_time": 2429.9, "end_time": 2431.2}, {"text": "Physical strength.", "start_time": 2432.9, "end_time": 2433.9}, {"text": "Has God Made You introverted.", "start_time": 2436.9, "end_time": 2438.6}, {"text": "Pierce Point.", "start_time": 2444.5, "end_time": 2445.5}, {"text": "However, God has made you.", "start_time": 2448.7, "end_time": 2450.6}, {"text": "And whatever God has given you.", "start_time": 2451.7, "end_time": 2453.5}, {"text": "Use it for his purpose.", "start_time": 2454.8, "end_time": 2457.9}, {"text": "All of it.", "start_time": 2460.7, "end_time": 2461.5}, {"text": "By the way.", "start_time": 2464.4, "end_time": 2465.2}, {"text": "if God has made you a male,", "start_time": 2468.1, "end_time": 2470.1}, {"text": "Live as a male for his glory.", "start_time": 2472.4, "end_time": 2473.7}, {"text": "God has made you a female live as a female for his glory.", "start_time": 2476.0, "end_time": 2479.0}, {"text": "Here's the thing. God didn't make a mistake when he made you.", "start_time": 2481.2, "end_time": 2484.0}, {"text": "He didn't make a mistake when he created you to be who he desires you to be.", "start_time": 2485.2, "end_time": 2489.7}, {"text": "God does not mess up.", "start_time": 2491.8, "end_time": 2494.1}, {"text": "We sit there and think, well, if I was only this were finally had that then then, you know, I could really be used of God, that's wrong thinking.", "start_time": 2496.6, "end_time": 2503.4}, {"text": "Use whatever it is. God is giving you", "start_time": 2505.0, "end_time": 2507.3}, {"text": "For his purpose and be selfless as Christ was selfless.", "start_time": 2508.6, "end_time": 2512.3}, {"text": "When Esther understood the magnitude and effect of the difficulty that confronted her, we see here that Esther went from being self-centered to being selfless, and the second conclusion is that Haman was self-centered.", "start_time": 2516.1, "end_time": 2528.3}, {"text": "I am is an interesting character in.", "start_time": 2529.5, "end_time": 2531.6}, {"text": "We'll spend a little bit of time, not a whole lot, but basically in verses 9 through 14, the author shows us a side of him and that is quite familiar to us.", "start_time": 2532.7, "end_time": 2540.5}, {"text": "Haman was pretty much all about Heyman.", "start_time": 2541.6, "end_time": 2544.1}, {"text": "His name means one, who is magnificent and there was nobody who thought Haman was more magnificent than a man himself.", "start_time": 2545.3, "end_time": 2550.7}, {"text": "He just loved himself and you know what? After having been invited to a private dinner for the king with Esther and then before he got to leave that day, he heard that Esther was going to then produce a dinner. Not just for the king, but for Hammond, the first is like, hey, you're an invited guest, enjoy the benefit of my feet. The second one is hate, this Feast is just as much for you Heyman, as it is for the king.", "start_time": 2552.0, "end_time": 2579.6}, {"text": "And Heyman, man. He left the palace that day. Happy, right. I mean, he walked outside of the the the dining hall there and I could imagine that the the sky was blue and the Sun was shining bright, and there was a cool breeze, perfect temperature. That day, the birds were tweeting his Praises him in his great. Haven is great. He's like the I am in it.", "start_time": 2581.9, "end_time": 2607.5}, {"text": "He was filled with joy and that's really what Heyman live for, he live for Joy. He lived for his own personal happiness, is something that the author of this story wanted to make sure we understood because there's no pollution here in a clumsy oaf inverse. Number 9, it says, at the beginning of this paragraph, I bet that came and went out that day. Look at the word joyful and glad of heart, then drop down all the way to verse number 14. And you'll see after he receives the the advice from Suresh, his wife and his friends. It says what then go. Joyfully, so joyful is at the beginning joyful is at the end Haman was all about his happiness him. It was all about his Joy, whatever made him, happy, whatever made him joyful, that's what was important to him.", "start_time": 2613.0, "end_time": 2657.9}, {"text": "No matter the cost.", "start_time": 2659.2, "end_time": 2659.9}, {"text": "And everything was going. Fantastic for him until he walked to the gate, and he sees Mordecai.", "start_time": 2661.6, "end_time": 2667.9}, {"text": "This insignificant little pests of a Jew.", "start_time": 2671.0, "end_time": 2674.1}, {"text": "Who won't even stand. There's no.", "start_time": 2676.0, "end_time": 2678.4}, {"text": "Way that Mordecai was going to genuflect for Haman here at this point.", "start_time": 2680.2, "end_time": 2685.2}, {"text": "It says that he didn't even Trimble. I can imagine Mordecai's thinking to himself or hey, man is thinking to himself. You know what?", "start_time": 2686.8, "end_time": 2694.2}, {"text": "I have turned the king's attention.", "start_time": 2695.2, "end_time": 2697.6}, {"text": "And purpose to issue an edict is going to exterminate your life, not now, but at some point you're going to die and and you still won't tremble in my presence.", "start_time": 2700.2, "end_time": 2709.8}, {"text": "Don't you know who I am?", "start_time": 2710.6, "end_time": 2712.3}, {"text": "I noticed how quickly came and went from joyful and glad of heart to being filled with Wrath.", "start_time": 2713.9, "end_time": 2721.0}, {"text": "Against Mordecai.", "start_time": 2722.1, "end_time": 2723.1}, {"text": "Here, he faces opposition and things didn't go the way he wanted them to go. When he was filled with rat that he became extremely discontent,", "start_time": 2725.4, "end_time": 2736.0}, {"text": "You have to read this story was so imagination, right? Because this next part quite literally makes me laugh. Every time I read it,", "start_time": 2742.4, "end_time": 2750.5}, {"text": "Because Heyman.", "start_time": 2751.6, "end_time": 2752.5}, {"text": "The Magnificent one.", "start_time": 2753.7, "end_time": 2754.9}, {"text": "He restrained himself, he didn't just reach out and take care of Mordecai at that moment. Most likely he was thinking your times coming.", "start_time": 2755.8, "end_time": 2762.1}, {"text": "I'll wait.", "start_time": 2763.3, "end_time": 2764.0}, {"text": "But then he goes home and he's feeling pretty bad about himself at this point.", "start_time": 2765.0, "end_time": 2767.7}, {"text": "Everything was great and now it's terrible. All because the reaction of one, dude.", "start_time": 2768.7, "end_time": 2772.4}, {"text": "I noticed what he does. He calls all of his friends together and pulls his wife into the room.", "start_time": 2773.6, "end_time": 2780.9}, {"text": "And he starts talking about himself.", "start_time": 2781.9, "end_time": 2783.7}, {"text": "Hayman recounted to them the Splendor of his riches. Hey, do you know how rich I am?", "start_time": 2786.8, "end_time": 2792.6}, {"text": "You need to think for a moment about how much money I have and how little money you have.", "start_time": 2793.9, "end_time": 2799.1}, {"text": "I'm richer than you. That's what's going on here.", "start_time": 2799.9, "end_time": 2802.9}, {"text": "And that he recounts to his wife. This part back me up to hear accounts to his wife. The number of sons, like she didn't know", "start_time": 2804.4, "end_time": 2811.6}, {"text": "I can imagine that, he's like it.", "start_time": 2815.6, "end_time": 2817.4}, {"text": "Babe, we have this many sons and she's like, tell me about it.", "start_time": 2818.2, "end_time": 2821.9}, {"text": "I was there when I gave birth to them.", "start_time": 2824.4, "end_time": 2826.6}, {"text": "Basically, what he's doing is, he's writing on Facebook post on steroids, right here. He's like look at me, look at me, look at me.", "start_time": 2830.9, "end_time": 2836.8}, {"text": "Instagram, praise me. Praise me. I'm worthy of Praise. My Little fragile ego is hurting cuz Mordecai hurt my feelings, but you need to praise me.", "start_time": 2839.9, "end_time": 2848.8}, {"text": "He says you know what, I've been promoted. Here's my metals.", "start_time": 2853.5, "end_time": 2857.6}, {"text": "Here's my pay stubs. As I've risen through the ranks above all, the other Servants of the king, and you know what, even The Queen Esther Made A Feast for The King, and I got invited to it today. And tomorrow, she's making a feast for us.", "start_time": 2859.1, "end_time": 2879.3}, {"text": "I am the greatest.", "start_time": 2884.7, "end_time": 2886.1}, {"text": "I can see in my mind, him recounting, all these things with just the biggest grin on his face, as he's talking about all of his possessions and all of his accomplishments. And all of the accolades that he's received and all of the honor that has been heaped upon him and then he stops for a minute. And he says,", "start_time": 2889.7, "end_time": 2907.1}, {"text": "But it all means nothing so long as Mordecai is alive.", "start_time": 2911.6, "end_time": 2914.7}, {"text": "It all means nothing.", "start_time": 2917.2, "end_time": 2918.9}, {"text": "As long as I see Mordecai the Jew.", "start_time": 2920.1, "end_time": 2922.8}, {"text": "Sitting at the king's gate.", "start_time": 2924.2, "end_time": 2925.5}, {"text": "Discontentment carries a terrible cost, doesn't it?", "start_time": 2928.9, "end_time": 2931.7}, {"text": "Just Mordecai's.", "start_time": 2935.1, "end_time": 2936.7}, {"text": "Presence.", "start_time": 2938.5, "end_time": 2939.3}, {"text": "Caused everything that was in Hammond to come rushing out of him.", "start_time": 2941.7, "end_time": 2946.7}, {"text": "His pride.", "start_time": 2949.5, "end_time": 2950.5}, {"text": "Discontentment please note. This discontentment is always always without fail rooted in Pride.", "start_time": 2952.7, "end_time": 2959.6}, {"text": "And it's Pride that says, you know, what I deserve more. Yes. I I deserve everything that I've received, but you know what? I also deserve for that little Jew.", "start_time": 2960.9, "end_time": 2971.4}, {"text": "To respect me.", "start_time": 2972.7, "end_time": 2973.8}, {"text": "As long as he doesn't, none of this other stuff means anything to me.", "start_time": 2975.9, "end_time": 2981.5}, {"text": "Because he is not exalting me.", "start_time": 2983.8, "end_time": 2986.4}, {"text": "But discontentment is also rooted and ingratitude.", "start_time": 2989.5, "end_time": 2992.5}, {"text": "And ingratitude reveals that we think we're responsible for what we have.", "start_time": 2995.1, "end_time": 2999.1}, {"text": "And when these two things come together and ensures that satisfaction is a goal, post that is constantly moving away from you.", "start_time": 3002.0, "end_time": 3010.5}, {"text": "You do the same thing, don't you?", "start_time": 3014.7, "end_time": 3016.0}, {"text": "We're actually more like Heyman in the story than what we like to admit.", "start_time": 3019.1, "end_time": 3021.9}, {"text": "You know what? God has been so good to me. I have, I have so many things. I've got a wonderful home, and I've got my health, and I've got my family in, and I, I've got some money saved away in. And I've got a job that I enjoy, and I just have so many things, but you know, what? I won't be. Truly satisfied until I get", "start_time": 3024.2, "end_time": 3045.9}, {"text": "blank, whatever.", "start_time": 3047.3, "end_time": 3049.2}, {"text": "We did Ecclesiastes look through Ecclesiastes. We saw that that the heart, the human heart is never truly satisfied with things.", "start_time": 3052.2, "end_time": 3059.8}, {"text": "If we make things the object of Our Lives, then we're continually going to be discontent.", "start_time": 3061.4, "end_time": 3066.6}, {"text": "We're more like Hannah. The story than we like to admit Haman, was an idolater in his Idol as revealed was public respect. He wanted everyone to acknowledge his greatness and when someone didn't do, what he demanded the idol of his heart was challenged and he was angry and discontent.", "start_time": 3070.6, "end_time": 3087.7}, {"text": "The Wonder the Apostle Paul said that godliness with contentment is great gain.", "start_time": 3092.0, "end_time": 3095.8}, {"text": "And thankfully the gospel frees those who have come to faith in Christ from craving, the approval of people. Why? Because you have been loved and accepted by God, you don't need the world to revolve around you. When you realize that God is actually at the center of everything and you are not", "start_time": 3097.8, "end_time": 3114.2}, {"text": "when you realize that everything's about God not about you and this is the opposite of the advice that Haman received", "start_time": 3115.6, "end_time": 3121.8}, {"text": "The advice, he even received his, do whatever you have to do to be happy. That that is building a Gallows, fifty feet, high or fifty cubits high and hanging Mordecai on it then so be it. That's what you got to do. Then do it and be joyful. Now, because you've gotten that one thing that stops you from enjoying everything else, but you know what had he hung Mordecai, then he would have been upset about something else. This revealed the orientation of his heart.", "start_time": 3123.9, "end_time": 3151.7}, {"text": "God, often allows difficulties to expose the orientation of your heart.", "start_time": 3156.7, "end_time": 3160.7}, {"text": "So we see this truth in both Esther and and Heyman.", "start_time": 3162.0, "end_time": 3165.2}, {"text": "so, my question to you, is this", "start_time": 3167.1, "end_time": 3169.0}, {"text": "To whom, do you turn?", "start_time": 3170.2, "end_time": 3172.6}, {"text": "When life is difficult.", "start_time": 3173.9, "end_time": 3174.9}, {"text": "We think back about the story than we think about the truth that Esther turn to someone who had the power to help in her time of need.", "start_time": 3178.4, "end_time": 3186.7}, {"text": "but hey man, turns himself", "start_time": 3188.7, "end_time": 3190.0}, {"text": "And to those who would feed his ego.", "start_time": 3191.8, "end_time": 3193.2}, {"text": "Esther was humble and selfless.", "start_time": 3195.9, "end_time": 3198.5}, {"text": "Haman was arrogant.", "start_time": 3200.0, "end_time": 3201.8}, {"text": "And self-centered.", "start_time": 3202.7, "end_time": 3203.7}, {"text": "So when difficulties arise in your life, do you turn to God?", "start_time": 3206.2, "end_time": 3211.6}, {"text": "Or do you turn to self?", "start_time": 3213.5, "end_time": 3215.6}, {"text": "And then, if I think about this in a larger picture,", "start_time": 3220.5, "end_time": 3223.7}, {"text": "I see really a beautiful truth here.", "start_time": 3227.4, "end_time": 3230.3}, {"text": "Esther had to go to a King and she hopes that he would accept her.", "start_time": 3232.5, "end_time": 3237.5}, {"text": "And she hoped that he would listen and she hoped that he would do.", "start_time": 3239.2, "end_time": 3244.1}, {"text": "What she asked him to do that. She that he would provide Deliverance for her and for her people.", "start_time": 3245.2, "end_time": 3250.4}, {"text": "But you know what, his Believers is, those who are in Christ, we need to see really something beautiful. And that is this that we have a greater King to turn to", "start_time": 3253.1, "end_time": 3261.7}, {"text": "and he bids us to come into him.", "start_time": 3264.1, "end_time": 3266.9}, {"text": "And to everyone who comes to this King through faith, in his son, then this king is a an ever-present help in time of trouble. He has a friend who sticks closer than a brother who is a friend who promised never to leave you or forsake. You", "start_time": 3269.0, "end_time": 3284.8}, {"text": "you don't have to ever be worried about being turned away from this King.", "start_time": 3286.4, "end_time": 3290.8}, {"text": "You don't have to worry about being ignored by this King. Our King has a throne that is established forever and there is no power above his power. So he has the ability and the compassion to help you in the times of your difficulty.", "start_time": 3291.9, "end_time": 3307.9}, {"text": "Our King knows everything.", "start_time": 3312.9, "end_time": 3314.5}, {"text": "Our King sees everything. Our King is all wives.", "start_time": 3315.7, "end_time": 3320.1}, {"text": "So when difficulties arise listen brother and sister, if you were in Christ, if you were saved you have access provided to you to this King turned to him and trust him and look to him for the help that only he can provide to you the psalmist put it this way. I lift my eyes to the hills from. Whence does come my help.", "start_time": 3321.7, "end_time": 3346.2}, {"text": "My help comes from the Lord who made Heaven and Earth.", "start_time": 3347.2, "end_time": 3350.9}, {"text": "We have a better King.", "start_time": 3353.8, "end_time": 3355.0}, {"text": "Did any Earthly King?", "start_time": 3356.4, "end_time": 3357.6}, {"text": "We can approach him.", "start_time": 3358.8, "end_time": 3360.1}, {"text": "But the orientation of our heart must be humble and selfless.", "start_time": 3362.4, "end_time": 3365.4}, {"text": "Not arrogant and self-centered.", "start_time": 3367.8, "end_time": 3369.6}, {"text": "Let me ask you one final question. I'm done.", "start_time": 3371.4, "end_time": 3373.3}, {"text": "Do you see difficulties as an opportunity to trust, God, and grow in Salvation?", "start_time": 3374.9, "end_time": 3380.7}, {"text": "That's what they're there for.", "start_time": 3383.1, "end_time": 3384.3}, {"text": "God is not some.", "start_time": 3386.8, "end_time": 3388.0}, {"text": "Vindictive.", "start_time": 3389.5, "end_time": 3390.7}, {"text": "Person.", "start_time": 3391.7, "end_time": 3392.6}, {"text": "Who loves to inflict pain on people.", "start_time": 3394.3, "end_time": 3396.7}, {"text": "There's a purpose for the difficulties that we faced in the scripture. Tells us clearly that the difficulties we as his people face are used for our good.", "start_time": 3398.0, "end_time": 3407.9}, {"text": "To make us more christ-like and ultimately for his purpose.", "start_time": 3409.1, "end_time": 3412.6}, {"text": "Difficulties reveal the orientation of your heart.", "start_time": 3416.3, "end_time": 3419.8}, {"text": "What is, what are the difficulties you go through reveal about you?", "start_time": 3422.2, "end_time": 3425.2}, {"text": "Father, thank you.", "start_time": 3426.4, "end_time": 3427.3}, {"text": "For the truth of your words. Thank you for hard truths.", "start_time": 3429.6, "end_time": 3433.3}, {"text": "For today, I've done that. The best that I can do.", "start_time": 3437.5, "end_time": 3441.1}, {"text": "Open your word to explain it to your people.", "start_time": 3442.6, "end_time": 3444.9}, {"text": "So that they might understand and apply it.", "start_time": 3446.9, "end_time": 3449.0}, {"text": "I thank you that you are our great king who could be approached in the Lord that we have the right to approach you not because of anything that we've done. But because our faith is in a crucified Risen, Savior, your son, whose blood made it possible for us to come boldly before your throne, and to make our petitions known.", "start_time": 3450.2, "end_time": 3469.5}, {"text": "Lord, I pray. If there are those in this audience today, those who are watching online, even who have never put their faith and trust in you Lord, perhaps they, they think that they can approach you by themselves that they don't need to put all of their hope and confidence in the work of another that they think.", "start_time": 3470.7, "end_time": 3488.1}, {"text": "Wrongly.", "start_time": 3489.4, "end_time": 3490.2}, {"text": "That you can be impressed by the things that they do in the way that they do them. Lord, I pray that you would open their eyes to the the fallacy of that thinking.", "start_time": 3491.3, "end_time": 3500.4}, {"text": "Or that they would realize. And understand there is nothing they can do to impress you. There's nothing that they can do to earn a place in your presence.", "start_time": 3502.2, "end_time": 3511.8}, {"text": "Lord that they might turn to Christ in faith. Believing the Jesus is your son.", "start_time": 3512.9, "end_time": 3518.7}, {"text": "But he was sinless that he died on the cross, in their place for their sin, that he's risen from the dead and then putting their faith and trust and hope in him. Lord, you will save them, you will make them a new creation. Father, you will adopt them and bring them into the family and you Lord.", "start_time": 3519.6, "end_time": 3535.6}, {"text": "Will be.", "start_time": 3539.6, "end_time": 3540.3}, {"text": "An ever-present help in time of trouble.", "start_time": 3541.8, "end_time": 3543.5}, {"text": "You are a great king.", "start_time": 3545.3, "end_time": 3546.2}, {"text": "Whom we love and serve.", "start_time": 3547.6, "end_time": 3548.9}, {"text": "Father, I pray that you would help us to see the purpose of our difficulties that you might be glorified in them for if we pray it in Jesus name, amen, list and worship.", "start_time": 3550.1, "end_time": 3559.4}]