[{"text": "Almost shocking.", "start_time": 0.0, "end_time": 0.9}, {"text": "But it is the heart cry of many people today.", "start_time": 2.7, "end_time": 5.2}, {"text": "Is Darkrai of many young people, especially in 2022.", "start_time": 6.7, "end_time": 11.2}, {"text": "You during the pandemic in 2020.", "start_time": 12.5, "end_time": 14.6}, {"text": "Studies. Tell us that one quarter 25% of adolescents consider taking their own life.", "start_time": 15.8, "end_time": 22.9}, {"text": "Suicide rates have risen steadily over the past decade suicide, is now the lead or the second leading cause of death for people, 10 to 24 years of age.", "start_time": 24.6, "end_time": 36.2}, {"text": "Think about that for a second. 10 years old.", "start_time": 37.5, "end_time": 39.9}, {"text": "We have today, more affluence.", "start_time": 42.2, "end_time": 44.5}, {"text": "We have more technology.", "start_time": 45.6, "end_time": 46.7}, {"text": "We have more information.", "start_time": 48.2, "end_time": 49.0}, {"text": "We have more luxury.", "start_time": 50.6, "end_time": 52.1}, {"text": "the more opportunities we have more Recreation, we have better living conditions than arguably, any people who have ever live in human history,", "start_time": 53.0, "end_time": 65.1}, {"text": "We are blessed beyond measure.", "start_time": 66.6, "end_time": 69.3}, {"text": "In life.", "start_time": 70.3, "end_time": 71.2}, {"text": "And more and more people hate life, so much.", "start_time": 72.9, "end_time": 75.8}, {"text": "That for them. Death seems to be the better alternative.", "start_time": 78.1, "end_time": 82.8}, {"text": "Does the Bible?", "start_time": 85.8, "end_time": 86.9}, {"text": "Give any answer?", "start_time": 88.0, "end_time": 89.6}, {"text": "To this problem.", "start_time": 90.6, "end_time": 91.4}, {"text": "Take your copy of God's word please and find Ecclesiastes chapter number to Ecclesiastes. We are on this journey through the Book of Ecclesiastes. It is a wonderful book. It is a misunderstood book. It is a book. I was just talking to somebody just a minute ago. That doesn't really get a whole lot of attention in church is today, and I think one of the reasons why it doesn't get a lot of attention is, it's not easy. It's there's not really a lot of feel-good happy-go-lucky things at the beginning of this book. It's challenging, its press sink. It and asks really hard questions and demands you to think before giving an answer", "start_time": 93.3, "end_time": 132.3}, {"text": "What we have now is we have Solomon, this man who was one of the greatest men who ever lived was King over Israel. We believe that he is the writer that kohelet, the preacher who is proclaiming this truth and it was probably being written down by a scribe as he was speaking. Somebody was taking really, really good notes. This person is seen as a narrator they show up in chapter 1 chapter 7, chapter 12. But we believe that though the bulk of the teaching is actually from Solomon himself, Solomon at this point was most likely an older man, maybe he was staring the end of his life.", "start_time": 133.5, "end_time": 169.3}, {"text": "In the face and his eventual end in. And when we get into chapter number to Solomon reveals that he was conducting an experiment, he was putting forth a test in this test with Chrissy. Okay? What's the best way to live? How is the best way to live? And so he decided to try to test living by wisdom by being a moral and upright person by saying the right things doing the right things, being honest, ethical, those types of things in, and he found that there was really no meaning in that. And so then he decided to live not by wisdom, but my family. And so, he then gave himself a morality, all sorts of amorality enjoyed every physical pleasure that he could enjoy. He said, in Chapter 2 that he did not keep his heart from anything at desired, any found that, that was all so meaningless. And then he decided that he would pursue getting things and having things in and getting as much stuff as he could possibly get", "start_time": 170.4, "end_time": 230.2}, {"text": "He did that he was among the richest who have ever lived in and he said at the end of that experiment. Okay, this is meaningless as well. This doesn't really do anything.", "start_time": 230.4, "end_time": 239.9}, {"text": "Then he decided to compare wisdom and Folly. What's the difference between wisdom and falling in? And which way, actually give the best life and and that also he found was meaningless. Although he did realize that, you know, living a moral and upright life. A wise life is certainly more profitable. It's better. He says than living a life of foolishness.", "start_time": 240.9, "end_time": 267.9}, {"text": "Then we get down to verse number 16.", "start_time": 270.6, "end_time": 272.8}, {"text": "Reverse number 16.", "start_time": 275.0, "end_time": 276.5}, {"text": "We see.", "start_time": 277.4, "end_time": 278.2}, {"text": "Really some dark.", "start_time": 280.9, "end_time": 282.5}, {"text": "Difficult, thanks.", "start_time": 283.6, "end_time": 285.8}, {"text": "To look with me at verse number 16, 90 this over last was, what the pastor been last week, talked about, but I want to point this out and then drive it in through the rest of the chapter.", "start_time": 286.8, "end_time": 298.0}, {"text": "2:16 the word of God, says, four of the wise as of the fool. There is no enduring remembrance seeing that in the days to come. All will have been long forgotten. How the wise dies just like the fool. So, I hated life because what is done under the sun was Grievous to me for all is Vanity and striving after wind", "start_time": 299.0, "end_time": 323.1}, {"text": "I hated all my toil and which I would toil on one side toil Under the Sun. Seeing that I must leave it to the man who will come after me and who knows, whether he will be a wise or a fool, yet, he will be master of all for which I toiled and use my wisdom under the sun.", "start_time": 324.2, "end_time": 340.7}, {"text": "This also is Vanity. So I turned about and gave my heart up to despair over all the toil of my labors under the sun because sometimes the person who is toiled with wisdom and knowledge and skill, must leave everything to be enjoyed by someone who did not toil for it.", "start_time": 341.7, "end_time": 358.6}, {"text": "This also is Vanity and a great evil.", "start_time": 359.4, "end_time": 361.3}, {"text": "What is a man from all the toil and striving of heart with which he toils beneath the Sun?", "start_time": 363.0, "end_time": 369.2}, {"text": "For all his days are full of sorrow and his work as a vexation.", "start_time": 370.2, "end_time": 374.3}, {"text": "Even in the night, his heart does not rest. This also is Vanity.", "start_time": 375.5, "end_time": 379.7}, {"text": "There is nothing better for a person than that. He she should eat drink and find enjoyment in his toil.", "start_time": 381.0, "end_time": 388.9}, {"text": "This also I saw is from the hand of God for a part from him.", "start_time": 389.7, "end_time": 394.2}, {"text": "Who can eat or who can have enjoyment?", "start_time": 395.1, "end_time": 397.7}, {"text": "We're to the one who pleases him God has given wisdom and knowledge and joy. But to the center, he is given the business of gathering and collecting only to give to one who pleases God.", "start_time": 399.0, "end_time": 410.4}, {"text": "This also is Vanity.", "start_time": 412.3, "end_time": 413.9}, {"text": "And a striving after wind.", "start_time": 414.9, "end_time": 418.2}, {"text": "I don't know if there was another passage of scripture in which we could say. This brother needs, Prozac more than that. When, you know what I'm saying.", "start_time": 420.7, "end_time": 426.6}, {"text": "Is guys having a hard time?", "start_time": 428.6, "end_time": 429.8}, {"text": "He's he's in a bad way.", "start_time": 431.5, "end_time": 432.9}, {"text": "His outlook on life is Grimm.", "start_time": 434.4, "end_time": 436.5}, {"text": "He's struggling through some things so much. So that that he says, I hated life and I hated work", "start_time": 437.6, "end_time": 447.3}, {"text": "I found Domine and I found a point to it. It's awful. It's terrible.", "start_time": 448.6, "end_time": 454.7}, {"text": "but then,", "start_time": 456.7, "end_time": 457.5}, {"text": "Almost out of nowhere.", "start_time": 458.6, "end_time": 460.1}, {"text": "we see him say,", "start_time": 461.4, "end_time": 462.4}, {"text": "There's nothing better.", "start_time": 464.4, "end_time": 465.2}, {"text": "There's nothing better for a person than that, he should eat and drink and find enjoyment that phrase. Find enjoyment, make your soul. See. Good", "start_time": 467.1, "end_time": 474.9}, {"text": "In life.", "start_time": 476.4, "end_time": 477.2}, {"text": "How in the world do you go from? I hate life?", "start_time": 478.7, "end_time": 483.6}, {"text": "There's nothing better than to enjoy life.", "start_time": 485.0, "end_time": 487.9}, {"text": "How do you make that Journey?", "start_time": 489.2, "end_time": 490.4}, {"text": "You know, as Philemon was riding this, there's really a message that the jumps out from the text forest and that is simply this and it's undeniable that God gives good gifts for people to enjoy. As you see this as we unpack it as we understand it and I think it will become very clear to you very plain to you, that God gives good gifts for people to enjoy. That's what the, the, the message of the last two verses of chapter two, or All About Us of optimism, in a Wilderness of Despair. So solemn and turn the corner at the conclusion of the test that he had initiated in his life. And after all had been said and done, and he decided to then, encourage Israel to stand before, Israel to Proclaim something that is encouraging to them. And what did he encourage Israel to do? Encourage Israel, to enjoy the good gifts that God provides each day?", "start_time": 492.5, "end_time": 546.9}, {"text": "I'm the same way. That's exactly what I want to do.", "start_time": 548.9, "end_time": 550.8}, {"text": "With you today I want to stand before you. I want to show you from the word of God that that you", "start_time": 551.8, "end_time": 558.4}, {"text": "Should in fact, enjoy.", "start_time": 559.8, "end_time": 561.8}, {"text": "The good gifts that God provides to you, each day.", "start_time": 563.0, "end_time": 566.1}, {"text": "That's hard. Why?", "start_time": 567.7, "end_time": 569.8}, {"text": "Because many people can all too easily relate to what Solomon said.", "start_time": 570.8, "end_time": 574.7}, {"text": "Many people can all too easily relate to 202. What he proclaims here and you may be sitting here today thinking to yourself, I hate life.", "start_time": 575.9, "end_time": 585.3}, {"text": "I've got no use for it.", "start_time": 587.2, "end_time": 588.6}, {"text": "Done this. And I've done that and I can't find any meaning in life whatsoever. And maybe for you sitting here today or maybe watching online, you're sitting there saying, you know what, death looks better to me than life because I hate life.", "start_time": 592.1, "end_time": 606.7}, {"text": "Maybe you're even considering throwing away. This precious gift that God has given you.", "start_time": 609.0, "end_time": 613.4}, {"text": "The god, The Giver of Life has entrusted to you and you're thinking, it'll what? I just I just want to be done.", "start_time": 614.3, "end_time": 619.6}, {"text": "Maybe you're dreading.", "start_time": 621.2, "end_time": 624.6}, {"text": "The end of this day because that means Monday starts and you go back to work.", "start_time": 626.1, "end_time": 629.9}, {"text": "And you hate work.", "start_time": 631.6, "end_time": 632.5}, {"text": "And you're one of those people, you know that you're going to post on social media. Oh no, it's Monday.", "start_time": 635.4, "end_time": 640.4}, {"text": "And then when you get the Friday you're like ye TGIF it's Friday.", "start_time": 642.8, "end_time": 646.9}, {"text": "But you hate everything that comes in between.", "start_time": 648.6, "end_time": 650.4}, {"text": "I hate it because for you, it just doesn't seem to be doing what you think it ought to be doing for you.", "start_time": 651.9, "end_time": 661.4}, {"text": "Why do we struggle with that, will it? I think it's because every person is born with a desire, within a deep innate longing to have something to make something to do something that's going to last and maybe even Outlast them.", "start_time": 662.5, "end_time": 675.7}, {"text": "They say they want their life to make a difference. They want to they're like to have meaning they want their life to to accomplish something to contribute, something good.", "start_time": 677.3, "end_time": 688.5}, {"text": "I hate the process.", "start_time": 690.9, "end_time": 692.2}, {"text": "And more than that, they hate the prospect that they could live their entire life do as much good as they possibly could. Do spend their whole lives working to gain something.", "start_time": 693.3, "end_time": 703.9}, {"text": "But they have absolutely no hope of keeping.", "start_time": 705.0, "end_time": 706.7}, {"text": "Because this is true. We need to know how to remove from hating life. We see this progression from Solomon. I hate life. I hate work. There's nothing better than to enjoy life in the good things that God gave you. How do you, how do you make that move? How do you, how does your heart reorient itself, from where it was to, where Solomon is, at the end of this text? How is that possible to move from hating life, and hating work to enjoying the good gifts in life? I want to show you today from the tech 3 realities.", "start_time": 711.5, "end_time": 739.9}, {"text": "That make a dramatic impact.", "start_time": 740.8, "end_time": 743.9}, {"text": "They made a dramatic impact of Solomon. Do make a dramatic impact on you as well. The first is this life on Earth is temporary", "start_time": 745.2, "end_time": 752.8}, {"text": "Life on Earth is temporary know, some of you were like woo-hoo, right? That's, that's the best news I've heard in a while. Life. On Earth is temporary. This place is tough, there is sorrow, there's heartache, there's paying their separation, there's disappointment, there's tragedy, there's the spare. There's there's unproductive moments, there's unfruitful times and and you're sitting there thinking man, I just have to endure and get through this life because there's more at the end of this life and we're thankful for that we rejoice in that truth. Paul said this, that if we only have hope in this life, we are among all people the most miserable. If this is all there is, we have no reason to have any hope any joy. We are, in fact, miserable people, but yet, there are people today. Believers Christian who know that there is more to come yet, they are so miserable in this life and they don't know why.", "start_time": 753.8, "end_time": 805.1}, {"text": "I can't explain it.", "start_time": 807.8, "end_time": 808.8}, {"text": "I think Solomon was there and he says,", "start_time": 812.0, "end_time": 814.1}, {"text": "basically life.", "start_time": 815.2, "end_time": 816.3}, {"text": "Is worth hating.", "start_time": 818.4, "end_time": 819.3}, {"text": "And it's temporary.", "start_time": 821.4, "end_time": 822.6}, {"text": "Solomon considered that the value of a of a life governed by wisdom, a life of pursuing pleasure life of consuming, with being consumed with Gathering. Possessions, he discovered that living wisely is again more beneficial than living foolishly. But then he came to this conclusion. Looking verse number 16 for the wise as of the fool, there is no enduring. Remember seeing that in the days to come. He will have been long forgotten. How the wise dies just like the full. This were Solomon goes, I can live my life by wisdom. I can do good things, I can do great things, I can gather as much as I can gather, I can be the greatest of all men who have ever lived. I can live by wisdom.", "start_time": 824.4, "end_time": 873.9}, {"text": "What does it matter?", "start_time": 876.6, "end_time": 877.3}, {"text": "We can look at it this way, you can decide to be a a man of wisdom and honor you can decide to be a person of honesty and integrity. You can have a strong work ethic be the first one in the last one out every day and never call in sick, never never miss a day of work and give your employer 100% of who you are while you're at work. And then you come home, whether you're a mom or a dad. If you give all that you can to do to being a great parent.", "start_time": 880.9, "end_time": 913.1}, {"text": "Train up your children in the nurture and admonition of the Lord.", "start_time": 914.7, "end_time": 917.8}, {"text": "If your grandparent you give everything you have to to helping your children, parent their children and being a a phenomenal grandparent to the guide, your grandchildren through in and you just live your life as honestly uprightly with as much wisdom and integrity, as you can possibly live it. And right next to you, there is somebody else an absolute fool.", "start_time": 919.3, "end_time": 941.5}, {"text": "Absolute fool, who is not honest does not work hard.", "start_time": 942.6, "end_time": 945.9}, {"text": "Is not a faithful spouse or a serious parent.", "start_time": 947.5, "end_time": 953.3}, {"text": "There's just that they live a joke of a life.", "start_time": 955.0, "end_time": 957.2}, {"text": "And you guys are are living on Parallel tracks, and then you come to the exact same end. Both of you die.", "start_time": 958.6, "end_time": 966.8}, {"text": "And neither of you is remembered.", "start_time": 970.4, "end_time": 971.9}, {"text": "I said a couple weeks ago, talk about, you know, there are people who are in fact remembered for what they did and who they were, and they're remembered for Generations. They're remembered even for centuries or millennia.", "start_time": 975.3, "end_time": 988.3}, {"text": "We still talk about Homer and Socrates and Plato. And we talked about in the Reformation 1500 Martin Luther and some of the, the great fathers of the reformation. And we talked about political Heroes.", "start_time": 989.7, "end_time": 1003.1}, {"text": "In our nation's history and we say well that we remember then we remember what they did. Yes. But that's", "start_time": 1004.3, "end_time": 1010.3}, {"text": "The minority.", "start_time": 1011.5, "end_time": 1012.6}, {"text": "The vast majority of the billions of people who have lived and died on this planet throughout its history live and no one or very few people even knew who they were and they died. And nobody today even know they existed.", "start_time": 1014.2, "end_time": 1027.6}, {"text": "You want proof that walk, it's walk through a cemetery and read the names. How many those people do, you know?", "start_time": 1031.1, "end_time": 1035.6}, {"text": "Or how many of those people do, you know anything about?", "start_time": 1037.2, "end_time": 1038.8}, {"text": "The only thing that you can learn from walking through the cemetery at the name of the person and maybe how long they lived and when they live, but you know nothing more than that.", "start_time": 1040.5, "end_time": 1048.7}, {"text": "And that is the end of most people.", "start_time": 1050.6, "end_time": 1054.4}, {"text": "And Solomon is looking at this thing, saying the wise person, and the fool, they live side-by-side. They live entirely different kinds of life that are antithetical to one another. They come to the exact same place. They die and no one remembers them. I hate life.", "start_time": 1055.4, "end_time": 1075.1}, {"text": "Makes no sense to me.", "start_time": 1076.4, "end_time": 1077.3}, {"text": "Why should I put so much time and effort in and being a person and living on this planet? When no amount of wisdom can prevent my death", "start_time": 1078.6, "end_time": 1089.4}, {"text": "So solemn and hated life.", "start_time": 1091.3, "end_time": 1092.4}, {"text": "Leo Tolstoy, he wrote this. He said my question.", "start_time": 1094.4, "end_time": 1097.1}, {"text": "That which is the age of 50, brought me to the verge of suicide was the simplest of questions lying in the soul of every man. A question without an answer to which one cannot live. It was what will come of what I am doing today or tomorrow? What will come of my whole life? Why should I live? Why wish for anything? Or do anything? If your support most of you will be familiar with it? Can also be Express dust. Is there any meaning in my life that the inevitable death awaiting me does not destroy.", "start_time": 1098.6, "end_time": 1130.6}, {"text": "so, I was saying,", "start_time": 1135.1, "end_time": 1136.1}, {"text": "I hated life.", "start_time": 1137.5, "end_time": 1138.5}, {"text": "Made no sense.", "start_time": 1140.9, "end_time": 1141.4}, {"text": "Solomon introduced a word to us here that we haven't seen yet. He says that his life on everything under the sun done under the sun. We know that's on this world has fallen Planet. Everything done on the sun was Grievous to me.", "start_time": 1144.1, "end_time": 1157.6}, {"text": "What does Grievous mean, it? It has the idea.", "start_time": 1159.1, "end_time": 1162.6}, {"text": "Of things aren't going the way. I thought they would go.", "start_time": 1163.7, "end_time": 1167.7}, {"text": "So imagine for a moment that you plan a vacation, it's going to be a great vacation. You haven't had a vacation in a little while. Why? Because you'll covid nobody traveled really. And so you book a, a beautiful Resort in the Caribbean and man, you're looking so forward to going down there and and eating good food and and having great accommodations and you're looking forward to the sun beating down on your face as you lay on the white sand beach and you hear. The waves lapping up on the the the shore there and then you get up and you put your feet in these Waters that are just crystal clear and annia. And you'll feel just the warmth of that moment and you're so. So looking forward to just a week away and enjoying these things.", "start_time": 1169.0, "end_time": 1216.6}, {"text": "And a couple hours before you're supposed to fly out, you're playing your flight gets canceled.", "start_time": 1220.0, "end_time": 1223.9}, {"text": "Linear rebook. And now instead of a direct flight, you have two or three different layovers and you get in hours later than what you thought you were going to get in. And and, and you're delayed really nearly you lost an entire day and then you get there and you're so looking forward to the first meal and you eat the food and then you get food poisoning.", "start_time": 1226.1, "end_time": 1244.1}, {"text": "And not only that but then there's a hurricane watch.", "start_time": 1249.8, "end_time": 1252.4}, {"text": "The storm rolls in and so you're trapped in the shelter and before you know it the vacation's over and your back on a plane and coming home and people ask, how did it go? And and the only, the only word that you have is it was Grievous to me.", "start_time": 1253.6, "end_time": 1267.7}, {"text": "It was such a disappointment, it didn't turn out like I planned it didn't turn out the way. I thought it was going to be, that's what it means. Solomon here is saying, listen, this idea of life and death, it's not what I thought it would be.", "start_time": 1269.2, "end_time": 1283.7}, {"text": "And I'm just disappointed.", "start_time": 1286.2, "end_time": 1287.0}, {"text": "Here's the issue.", "start_time": 1295.0, "end_time": 1295.8}, {"text": "Death is a part of life.", "start_time": 1297.4, "end_time": 1298.5}, {"text": "Death is a part of life and it's guaranteed why? Because", "start_time": 1300.1, "end_time": 1303.3}, {"text": "Ascend.", "start_time": 1304.2, "end_time": 1304.9}, {"text": "When Adam and Eve were created and lived in Holiness and lived in Purity, they were created and lived on a planet that was pure and they were told do not eat of the of the tree of the knowledge of Good and Evil, the eighth of it and immediately in that moment they died spiritually. We know that y", "start_time": 1306.2, "end_time": 1322.0}, {"text": "Because they hid from God.", "start_time": 1323.4, "end_time": 1324.8}, {"text": "Then you turn the page to Genesis 4.", "start_time": 1328.1, "end_time": 1330.3}, {"text": "And pain, Rises up against table, and kills him.", "start_time": 1332.5, "end_time": 1335.3}, {"text": "And he died.", "start_time": 1336.4, "end_time": 1337.0}, {"text": "And then you get to Genesis chapter 5 and it tells us that Adam lived over 900 years and then you see the phrase and he died.", "start_time": 1338.2, "end_time": 1346.9}, {"text": "And over and over again in Genesis 5 you hear that same refrain like a drum beat consistently and he died and he died and he died and he died. Death is a part of life just as much as Life as a part of life and it cannot be escaped.", "start_time": 1349.4, "end_time": 1366.5}, {"text": "We live with the reality that our life here is short. James says, it's like a vapor that appears for a little while and then vanishes away.", "start_time": 1368.1, "end_time": 1377.4}, {"text": "And death is guaranteed because the curse.", "start_time": 1382.0, "end_time": 1384.1}, {"text": "and if it's the point of life, that is only getting to the day of death,", "start_time": 1385.8, "end_time": 1390.2}, {"text": "It's a point of life is only getting to that moment when your heart stops beating and you stop breathing and your soul, leave this body. If that's the point of life than surely, everyone is going to find. Everyone's going to struggle to find meaning in life.", "start_time": 1391.2, "end_time": 1407.6}, {"text": "Especially when you realize that one day, everything that you've accomplished in life will be long, forgot.", "start_time": 1410.1, "end_time": 1415.1}, {"text": "And it begs the question.", "start_time": 1416.9, "end_time": 1418.2}, {"text": "Why do we put all our ships down on a hand. We can't win.", "start_time": 1419.3, "end_time": 1422.2}, {"text": "Why do we take everything all of our hopes? All of our dreams, everything that we think life is about, and we take it and we shove it to the middle of the table. We say I'm all in for this for this life,", "start_time": 1424.9, "end_time": 1436.7}, {"text": "When we know we can't win.", "start_time": 1437.8, "end_time": 1439.8}, {"text": "Because death is going to take it all the way. Anyway,", "start_time": 1443.7, "end_time": 1445.6}, {"text": "I told you earlier service, I'll tell you the same thing passages like this, that make me love the word of God.", "start_time": 1448.3, "end_time": 1455.2}, {"text": "You may be saying yourself, you are really twisted.", "start_time": 1457.3, "end_time": 1459.7}, {"text": "I hated life. You like that part.", "start_time": 1461.7, "end_time": 1463.8}, {"text": "I like how real it is.", "start_time": 1465.7, "end_time": 1467.1}, {"text": "I like how genuine it is. Is", "start_time": 1469.7, "end_time": 1472.8}, {"text": "I like the fact that Solomon just just peeled back the blinders here and lays it out and says this is how I felt about it.", "start_time": 1474.9, "end_time": 1481.6}, {"text": "Tell me the scripture was written by the inspiration of God, not by man, because man would never be this honest.", "start_time": 1485.6, "end_time": 1492.0}, {"text": "so, you're sure we would really, really", "start_time": 1494.1, "end_time": 1497.7}, {"text": "You're you're out getting coffee at the point this morning before you came in here and someone came up to you and said hey how's life? And you said great.", "start_time": 1499.9, "end_time": 1508.0}, {"text": "When your life is a dumpster fire.", "start_time": 1509.8, "end_time": 1511.4}, {"text": "and, you know, it", "start_time": 1512.7, "end_time": 1513.5}, {"text": "You're thinking yourself before you came here. I hate life.", "start_time": 1514.9, "end_time": 1518.1}, {"text": "I hate work.", "start_time": 1519.4, "end_time": 1520.4}, {"text": "Your marriage is in shambles, your home is an utter chaos because your children run around like those terrorist, that can't be controlled.", "start_time": 1522.7, "end_time": 1529.2}, {"text": "Your finances are a mess.", "start_time": 1534.6, "end_time": 1536.3}, {"text": "You work situation is.", "start_time": 1537.5, "end_time": 1539.0}, {"text": "Parable.", "start_time": 1540.5, "end_time": 1541.4}, {"text": "Can you walk into church? And someone is standing next to you getting coffee and they say, how are you doing? And you say, great.", "start_time": 1542.9, "end_time": 1549.4}, {"text": "How's the family gun?", "start_time": 1551.7, "end_time": 1553.1}, {"text": "How's work? Awesome.", "start_time": 1554.5, "end_time": 1555.8}, {"text": "Kids good, all their perfect.", "start_time": 1556.9, "end_time": 1558.7}, {"text": "We're not real with one another most the time.", "start_time": 1564.5, "end_time": 1566.7}, {"text": "We should be but we're not.", "start_time": 1568.1, "end_time": 1569.6}, {"text": "Here. Solomon. Just lays it out, says", "start_time": 1571.4, "end_time": 1573.5}, {"text": "I'm one of the greatest men who's ever lived and I hated life.", "start_time": 1575.6, "end_time": 1578.3}, {"text": "I love the reap, the realness of it, the wrong, Miss of it.", "start_time": 1580.6, "end_time": 1584.2}, {"text": "Word of God to pull the blinders off so that we can see. And IT addresses things not as we hoped they would be, but as they actually are", "start_time": 1585.0, "end_time": 1592.6}, {"text": "I think it's almond addresses. Here is life on Earth is temporary because death cannot be avoided. The second thing is that life on Earth is unfair,", "start_time": 1594.8, "end_time": 1601.9}, {"text": "My kids would I always hated the whole that's not fair thing. It's one of the things like if my kids ever yelled out", "start_time": 1603.8, "end_time": 1612.3}, {"text": "I mean like life's not fair. It's tough wear a helmet. You'll be fine, you know.", "start_time": 1615.3, "end_time": 1620.3}, {"text": "I didn't have time for that nonsense. Life isn't fair.", "start_time": 1622.1, "end_time": 1625.0}, {"text": "Life isn't always just.", "start_time": 1626.3, "end_time": 1627.9}, {"text": "Deal with it.", "start_time": 1629.2, "end_time": 1629.9}, {"text": "Who's the terrible father?", "start_time": 1631.6, "end_time": 1632.6}, {"text": "But you can ask them and they've heard that build a bridge and get over your fine relax.", "start_time": 1635.9, "end_time": 1640.7}, {"text": "Solomon here. He he acknowledges starting in verse number 18.", "start_time": 1642.6, "end_time": 1646.4}, {"text": "That that we gained possession through work.", "start_time": 1648.0, "end_time": 1650.2}, {"text": "An inverse number 10, he admitted that this gives pleasure.", "start_time": 1651.1, "end_time": 1653.8}, {"text": "The idea of Solomon would build something and then he would stand outside of it and look at it. And his heart would be filled with joy and pleasure because of what had been built.", "start_time": 1654.7, "end_time": 1662.9}, {"text": "Or your walk into the treasury, which was stacked with gold and silver in all sorts of precious jewels. He was one of the richest man men who had ever lived and walked into his treasury building. And it would look in his heart would be filled with joy and pride and and he would enjoy the sight of all that he had all that he possessed, or maybe he'd walk out through his pasture. And he would look out. He would see these magnificent flocks of all sorts of beasts and he would be filled with pride and joy at what he had gained, or maybe he would go to his Palace, and he would walk into the dining room and he, he would sit there at the table. And he would see all sorts of good food, and good drink, everything, that his heart desired, the best of everything and anything. He felt accomplished. He felt pleasure, he felt Joy at this. He said, listen, there is pleasure. There is joy that comes as the reward of your labor of your work.", "start_time": 1664.7, "end_time": 1718.9}, {"text": "and then, I got to thinking", "start_time": 1723.8, "end_time": 1725.0}, {"text": "What happens to all the stuff when I die?", "start_time": 1727.7, "end_time": 1729.4}, {"text": "I'm going to die.", "start_time": 1732.3, "end_time": 1733.0}, {"text": "The wise and the fool, they both died. So what What Becomes of this? And then he started thinking well, what if", "start_time": 1734.4, "end_time": 1740.1}, {"text": "Somebody gets all this stuff.", "start_time": 1742.0, "end_time": 1743.9}, {"text": "They become the master of all that I have toiled and laboured to to to gain to acquire and and they become the master of it in and maybe they're not going to be wise with it. Maybe they're going to be foolish with it and maybe they'll squander it all.", "start_time": 1745.2, "end_time": 1760.9}, {"text": "And then, what was the purpose?", "start_time": 1762.5, "end_time": 1763.8}, {"text": "I'm working so hard to gain all of this.", "start_time": 1765.3, "end_time": 1767.8}, {"text": "Wendell just squander it.", "start_time": 1769.4, "end_time": 1771.8}, {"text": "How long was the Thinker?", "start_time": 1776.1, "end_time": 1777.3}, {"text": "He thought I won fair. How", "start_time": 1780.5, "end_time": 1782.3}, {"text": "Unjust.", "start_time": 1783.6, "end_time": 1784.6}, {"text": "That this would happen.", "start_time": 1785.5, "end_time": 1786.4}, {"text": "Most of, you know, that the idiom that hit too close to home", "start_time": 1790.4, "end_time": 1793.9}, {"text": "I think perhaps the Solomon was thinking about this the thought.", "start_time": 1796.0, "end_time": 1799.4}, {"text": "Of.", "start_time": 1801.1, "end_time": 1801.6}, {"text": "Having everything he had gained being turned over to an are called inheritance and then being the potential for to be squandered by foolish living.", "start_time": 1802.7, "end_time": 1814.6}, {"text": "Potentially hit a little too close to home.", "start_time": 1815.9, "end_time": 1817.6}, {"text": "And it affected him deeply.", "start_time": 1821.4, "end_time": 1822.7}, {"text": "It affected him emotionally.", "start_time": 1824.7, "end_time": 1826.5}, {"text": "Because he could see this potentially happening.", "start_time": 1828.5, "end_time": 1832.2}, {"text": "To him.", "start_time": 1833.2, "end_time": 1833.8}, {"text": "And we see this progression in the words that he uses their emotional words, he's he's describing really, how he was feeling about all of this. Look with me a number 20. He says, every thought about this that this all the stuff that he had would be given over to another one and they would be a master of all that he had worked so hard for and that he had used his wisdom to get under the sun and that's just meaningless me Bruce or 20. I turned about and gave my heart up to despair.", "start_time": 1836.2, "end_time": 1865.2}, {"text": "It means that he", "start_time": 1869.4, "end_time": 1870.7}, {"text": "had no hope.", "start_time": 1872.7, "end_time": 1873.7}, {"text": "That did the thought of leaving all this stuff to somebody else just turned his heart from hoped hopelessness.", "start_time": 1876.4, "end_time": 1882.4}, {"text": "What's wrong with? This is just crazy.", "start_time": 1883.8, "end_time": 1885.7}, {"text": "Why won't why would I do this?", "start_time": 1887.2, "end_time": 1889.1}, {"text": "But it got worse.", "start_time": 1891.2, "end_time": 1892.3}, {"text": "Look on the first number 21.", "start_time": 1893.6, "end_time": 1895.3}, {"text": "He said that he's going to leave everything to be enjoyed by someone who did not work for it.", "start_time": 1896.6, "end_time": 1901.5}, {"text": "That's vanity of the great evil.", "start_time": 1903.1, "end_time": 1904.9}, {"text": "The great evil, the word means it it's a it's a kind of misery.", "start_time": 1906.6, "end_time": 1910.5}, {"text": "That that leads to pain.", "start_time": 1912.5, "end_time": 1914.4}, {"text": "An illness.", "start_time": 1916.6, "end_time": 1917.3}, {"text": "Maybe you have in your life.", "start_time": 1919.1, "end_time": 1921.2}, {"text": "Thought of something that was coming and it it was so Troublesome to you that that it brought deep anguish to you and it and it brought misery to you and it made you physically ill it, affected you at the gut-level.", "start_time": 1923.0, "end_time": 1936.5}, {"text": "You felt sick to your stomach.", "start_time": 1937.7, "end_time": 1938.9}, {"text": "When you thought about it.", "start_time": 1940.4, "end_time": 1941.5}, {"text": "So Solomon.", "start_time": 1943.2, "end_time": 1944.1}, {"text": "Was struggling with.", "start_time": 1945.4, "end_time": 1946.4}, {"text": "Oh, but it got worse.", "start_time": 1947.5, "end_time": 1948.6}, {"text": "He says, for what is a man from all the toil and striving of heart with which he toils Under the Sun for his days are full of Sorrow?", "start_time": 1950.1, "end_time": 1957.4}, {"text": "This is emotional distress.", "start_time": 1961.7, "end_time": 1963.5}, {"text": "And pain.", "start_time": 1965.3, "end_time": 1966.1}, {"text": "His work is fixation, it's grief.", "start_time": 1969.1, "end_time": 1972.6}, {"text": "And ultimately, it robs him of rest.", "start_time": 1975.2, "end_time": 1977.4}, {"text": "There's no sleep.", "start_time": 1978.9, "end_time": 1979.7}, {"text": "He progresses emotionally down this ladder to a place where he is so bent out of shape.", "start_time": 1983.7, "end_time": 1991.5}, {"text": "At the thought that everything he had was going to be left and squandered.", "start_time": 1993.3, "end_time": 1999.4}, {"text": "His fear was unfounded.", "start_time": 2004.6, "end_time": 2005.8}, {"text": "because if you know, the story of Solomon, did you know that when he died", "start_time": 2008.8, "end_time": 2012.8}, {"text": "His son rehoboam.", "start_time": 2013.7, "end_time": 2014.6}, {"text": "Receive the kingdom.", "start_time": 2016.0, "end_time": 2017.0}, {"text": "He received all the Solomon hat, all of the riches.", "start_time": 2018.4, "end_time": 2022.5}, {"text": "All of the flocks and herds, the homes. Everything that Solomon built was handed over to the hand of Rehabilitation", "start_time": 2023.7, "end_time": 2030.5}, {"text": "Andrea ball. I'm in a very short. Of time lost 80%.", "start_time": 2032.2, "end_time": 2035.8}, {"text": "Of everything you got.", "start_time": 2037.5, "end_time": 2039.0}, {"text": "It was a fool.", "start_time": 2040.9, "end_time": 2041.8}, {"text": "Who followed the advice of foolish men.", "start_time": 2042.8, "end_time": 2045.2}, {"text": "Which then caused the kingdom to break apart Israel, to the north became its own Nation. Judah to the South became the nation over which real bomb rule.", "start_time": 2046.3, "end_time": 2055.7}, {"text": "and not long after Israel, was established as its own Nation Under jeroboam", "start_time": 2056.9, "end_time": 2061.1}, {"text": "It was invaded, it was destroyed, and it was just the people were dispersed into Spanish.", "start_time": 2062.2, "end_time": 2067.7}, {"text": "It took several more years but eventually Judah was invaded. The walls of Jerusalem were broken down that the temple was plundered of the gold was stripped off of the walls of the instruments that were used for worship. The cups in the, all of those things were taken aback to Babylon,", "start_time": 2070.3, "end_time": 2090.0}, {"text": "And then the entire Temple was destroyed ran after it's been ransacked, it was raised. It was reduced to Rubble.", "start_time": 2093.4, "end_time": 2103.0}, {"text": "The Vineyards, the Solomon planted, the gardens that were magnificent. People came from all over the world to see where destroy the houses that he built laid waste.", "start_time": 2105.0, "end_time": 2113.9}, {"text": "It was all gone.", "start_time": 2115.2, "end_time": 2116.0}, {"text": "Was it Ellis?", "start_time": 2127.3, "end_time": 2128.1}, {"text": "It tells us that if we try to find meaning in the things that we work for because we can leave it to somebody else, we're going to be sorely disappointed.", "start_time": 2131.5, "end_time": 2139.7}, {"text": "It tells us also this the people often hate work, you hear it all the time they hate work. Why not? Because work is hard, but because they are expecting their work to do what only God can do for them.", "start_time": 2141.5, "end_time": 2153.4}, {"text": "If you're in a small group this week, you're going to learn that that working is good. Working hard is good. You're going to see that that saving is good and investing is good and right and necessary and needed.", "start_time": 2155.5, "end_time": 2167.5}, {"text": "But the nature of life and death makes putting any hope in what we have absolutely pointless.", "start_time": 2169.0, "end_time": 2174.6}, {"text": "And if you make any of these things ultimate, you will become empty and Restless. Why? Because you can't take any of it with you.", "start_time": 2176.1, "end_time": 2183.2}, {"text": "Someone's going to spend what you saved.", "start_time": 2185.5, "end_time": 2187.4}, {"text": "The life on Earth is temporary and unfair and I still haven't yet answered the question. How do you enjoy life? How do you reorder that your heart from? I hate life and I hate work to enjoying it.", "start_time": 2190.8, "end_time": 2202.4}, {"text": "Look at verses 24 through 26. And see that looking to God provides the necessary perspective.", "start_time": 2204.9, "end_time": 2209.7}, {"text": "Looking to God provides the necessary perspective.", "start_time": 2211.2, "end_time": 2214.6}, {"text": "You know, we we have this. I don't know.", "start_time": 2215.7, "end_time": 2219.9}, {"text": "This moment in the scripture, it's really odd, it's, it's strange. It's almost bipolar. If you let me put it that way,", "start_time": 2222.3, "end_time": 2231.1}, {"text": "he is so down and then a number 24. It's a totally different Outlook, everything changes. It's a turning point. It's a hinge Point really in the the message of Ecclesiastes there is nothing better for a person than that. He should eat and drink and find enjoyment in his toil. What do you mean the toil that he hates? Yes.", "start_time": 2232.3, "end_time": 2251.2}, {"text": "What?", "start_time": 2252.3, "end_time": 2252.8}, {"text": "To enjoy the life that you hate. Yes. How", "start_time": 2254.0, "end_time": 2257.4}, {"text": "you have to notice that Solomon.", "start_time": 2259.9, "end_time": 2262.1}, {"text": "Is tone changed. When he began to consider that enjoyable things, including work and the game that comes from work. These things are a gift from the hand of God.", "start_time": 2263.1, "end_time": 2273.4}, {"text": "Solomon also acknowledged that apart from God. There is frustration and there is emptiness looking for his number 26. He talks about the center", "start_time": 2277.0, "end_time": 2284.6}, {"text": "Go to The Sinner. He has given, God has given the business of gathering and collecting, this is what the center does. This is what the person who does not know God does they live all of their life Gathering and collecting and Gathering and collecting and then they die and what happens to the stuff that they've gathered, it goes to the person who pleases God", "start_time": 2285.6, "end_time": 2303.4}, {"text": "there's no lasting benefit from that for the person who spends their life, giving them self to getting things because they think that those things", "start_time": 2307.0, "end_time": 2318.3}, {"text": "Are what give life mean?", "start_time": 2319.9, "end_time": 2321.2}, {"text": "But to the one who pleases God, God gives wisdom that's ability to do that, which is good knowledge. The result of learning from perception of reasoning and joy.", "start_time": 2324.4, "end_time": 2335.1}, {"text": "I have happiness and pleasure in life, why?", "start_time": 2336.7, "end_time": 2339.7}, {"text": "Because their soul sees good.", "start_time": 2341.2, "end_time": 2343.9}, {"text": "They have the right vision of God, therefore they enjoy life.", "start_time": 2345.1, "end_time": 2350.6}, {"text": "Now I got to deal with the phrase here pleasing God because whenever you see pleasing God or mine typically glowed goes to obeying God loving God, doing what God wants us to do and that pleases God.", "start_time": 2353.0, "end_time": 2365.1}, {"text": "But doesn't mean that at all.", "start_time": 2366.6, "end_time": 2367.9}, {"text": "Did you know that there is an actual condition?", "start_time": 2369.6, "end_time": 2372.4}, {"text": "Known as text neck syndrome.", "start_time": 2374.1, "end_time": 2377.2}, {"text": "Text neck syndrome. It's a real thing. Look it up. Don't look it up now, but look it up later. It is an absolute real thing. It's described as a repetitive stress injury, that is caused by having your head in a forward position for an extended. Of time. It is this", "start_time": 2379.0, "end_time": 2395.6}, {"text": "That's what it is.", "start_time": 2399.8, "end_time": 2400.5}, {"text": "Text neck syndrome. Real honestly. Yesterday, I was driving down Polaris and I stopped at a stoplight. And I, and I looked over at a car next to me, it's an SUV that had the windows down and you had a man and woman. I'm assuming a mom and a dad in the, in the front seat and and then you had two children and the backseat, one of them wasn't, it was in a car seat, one of the children, not the parent. One of the children was in the car seat and and they were sitting there and I look over and all four of them.", "start_time": 2401.6, "end_time": 2432.3}, {"text": "We're doing this.", "start_time": 2433.5, "end_time": 2434.2}, {"text": "All four of them, this", "start_time": 2437.2, "end_time": 2439.7}, {"text": "I thought to myself including the driver? Yes, I like this. And I'm like", "start_time": 2440.7, "end_time": 2444.6}, {"text": "Man, we can't get the phone out of our face, can we?", "start_time": 2445.8, "end_time": 2450.8}, {"text": "It is cause the condition text neck syndrome.", "start_time": 2452.5, "end_time": 2455.7}, {"text": "What does any of that have to do what I'm talkin about?", "start_time": 2457.3, "end_time": 2459.4}, {"text": "The one who pleases God.", "start_time": 2461.7, "end_time": 2463.1}, {"text": "Is the one who instead of a phone keeps God's face before them.", "start_time": 2464.6, "end_time": 2470.1}, {"text": "That's what it means.", "start_time": 2472.8, "end_time": 2473.5}, {"text": "It means to keep God's face.", "start_time": 2475.1, "end_time": 2476.9}, {"text": "Before their eyes.", "start_time": 2478.3, "end_time": 2479.2}, {"text": "It is quite literally means that the person who pleases God is the one who is continually looking to God and acknowledging God in all things and honoring God by being grateful to God.", "start_time": 2481.4, "end_time": 2493.4}, {"text": "That's what it means to. Please got here.", "start_time": 2497.9, "end_time": 2499.4}, {"text": "Solomon said when I looked to him,", "start_time": 2500.7, "end_time": 2504.2}, {"text": "My perspective changed.", "start_time": 2506.1, "end_time": 2507.9}, {"text": "And now I could see that these things in life, the food, the drink, the possessions. All of these things there they're not, they're not a means to finding meaning in life. They are what they are. They are good gifts from the hand of God to be enjoyed.", "start_time": 2509.4, "end_time": 2526.8}, {"text": "In life.", "start_time": 2527.8, "end_time": 2528.5}, {"text": "And nothing more.", "start_time": 2529.8, "end_time": 2530.6}, {"text": "Here's the thing about Solomon though. He could only acknowledge Garden.", "start_time": 2535.5, "end_time": 2539.5}, {"text": "Hear from God, he could not come into the presence of God. Only the high priest could come into the presence of God. Even the high priest couldn't go into the presence of God, whenever he felt like, if he can only go in once a year,", "start_time": 2540.3, "end_time": 2549.8}, {"text": "We have it so much better than Solomon.", "start_time": 2554.8, "end_time": 2556.4}, {"text": "Because Jesus, our great high priest.", "start_time": 2558.9, "end_time": 2560.9}, {"text": "On the cross. In his death, he tore the Veil", "start_time": 2562.6, "end_time": 2566.6}, {"text": "It's separated the holy place from the most holy place, and he made possible.", "start_time": 2567.7, "end_time": 2572.1}, {"text": "You made it possible for people who were separated from God. People who are estranged from God, to be brought into the presence of God by faith and trust in who Jesus is in what Jesus did on the cross.", "start_time": 2573.2, "end_time": 2585.5}, {"text": "By his blood.", "start_time": 2589.0, "end_time": 2589.9}, {"text": "He brings everyone who believes in him to God. And now, those of us who are brought to God and presented before God, we, through God's word, consigo, and we can know him and we are before God's face and by his grace and kindness us, God is before us, his face is before us.", "start_time": 2591.1, "end_time": 2612.3}, {"text": "And I think to myself what a tragic state to have the privilege of being face-to-face with God, but to neglected, because we have fixed our Gaze on the things that we've been given trying to figure out how to keep them trying to look for these things for meaning, instead of fixing our Gaze, on the one who gave them to us,", "start_time": 2614.3, "end_time": 2632.9}, {"text": "And please don't miss the point.", "start_time": 2636.3, "end_time": 2637.5}, {"text": "God gives good gifts, first people to enjoy and a gift that makes enjoying all the other gifts. Possible is the gift of God's son.", "start_time": 2638.8, "end_time": 2649.7}, {"text": "Only Jesus can bring you to God and make you acceptable to God. This means that Jesus and knowing him is the key for moving. From hating life, to enjoying life.", "start_time": 2651.8, "end_time": 2665.1}, {"text": "Because knowing Jesus allows us to have the right perspective.", "start_time": 2667.6, "end_time": 2670.7}, {"text": "perhaps, you're a Believer here today, and", "start_time": 2674.1, "end_time": 2676.0}, {"text": "You hate life.", "start_time": 2677.6, "end_time": 2678.5}, {"text": "You truly hate life.", "start_time": 2680.3, "end_time": 2681.6}, {"text": "You hate work.", "start_time": 2683.2, "end_time": 2684.0}, {"text": "And you share the, the, the frustration of Solomon as expressed in the Statue, like, man, I can't stand this.", "start_time": 2686.1, "end_time": 2692.9}, {"text": "I know how Solomon felt. I'm with him.", "start_time": 2694.1, "end_time": 2696.4}, {"text": "and now you've listened to this message, you listen to me talk now for for several", "start_time": 2698.8, "end_time": 2702.4}, {"text": "Minutes will call the minutes, right?", "start_time": 2703.2, "end_time": 2706.2}, {"text": "And you're wondering why being saved hasn't solved the problem for you.", "start_time": 2707.6, "end_time": 2711.0}, {"text": "I'm saved. I'm in priced. I know God. Why do I still feel this way? Why do I struggle with hating life? Why do I hate work? Why why do I see? Everything is absolutely meaningless.", "start_time": 2712.8, "end_time": 2724.1}, {"text": "if you were deeply the satisfied,", "start_time": 2730.2, "end_time": 2732.2}, {"text": "In life.", "start_time": 2733.5, "end_time": 2734.2}, {"text": "You might be taking the things that God intended for you to enjoy and making them the focus of your life.", "start_time": 2735.6, "end_time": 2742.2}, {"text": "You may be looking to work.", "start_time": 2744.9, "end_time": 2746.4}, {"text": "To provide meaning for you.", "start_time": 2747.3, "end_time": 2748.8}, {"text": "You may be looking to a relationship to provide meaning for you. You may be looking to your finances, your Investments, your bank account to provide meaning for you.", "start_time": 2750.0, "end_time": 2760.2}, {"text": "you may be looking to your home, or", "start_time": 2761.3, "end_time": 2763.0}, {"text": "The things that you have to provide meaning for you and and those things cannot be for you. What you want them to be.", "start_time": 2764.6, "end_time": 2773.2}, {"text": "And what is that lead to continual disappointment and stress.", "start_time": 2776.1, "end_time": 2779.7}, {"text": "Why? Because God is not at the center of things for you.", "start_time": 2781.8, "end_time": 2784.7}, {"text": "I'm sorry to tell you this, but you falling into the Trap of believing that you will find what you're longing for in the things of this life. Even good things even good gifts from God. You look at them as more than that.", "start_time": 2786.6, "end_time": 2798.5}, {"text": "This is why you're miserable.", "start_time": 2799.5, "end_time": 2800.7}, {"text": "Because nothing. This world offers can be the functional savior. You want them to be everything. This world offers will in fact, fail, if not today it will fail sometime.", "start_time": 2802.2, "end_time": 2813.3}, {"text": "And the things that you were looking to for meaning that continually disappoint you and fail, you, they were never intended to give you meaning, they were never intended to give you purpose. They were only given to you by the hand of God to be enjoyed.", "start_time": 2818.0, "end_time": 2833.5}, {"text": "In this life.", "start_time": 2834.6, "end_time": 2835.5}, {"text": "But enjoyment cannot happen. Apart from God.", "start_time": 2837.8, "end_time": 2840.0}, {"text": "So friend, here is the solution.", "start_time": 2841.9, "end_time": 2843.3}, {"text": "Fix your eyes on God.", "start_time": 2844.6, "end_time": 2845.7}, {"text": "Put in before your face and accept with gratitude, the good things that God has provided to you and enjoy them for what they are.", "start_time": 2847.8, "end_time": 2857.7}, {"text": "Not for what you want them to be.", "start_time": 2859.7, "end_time": 2861.1}, {"text": "Think about it this way.", "start_time": 2863.5, "end_time": 2864.6}, {"text": "If you do not enjoy God's gifts.", "start_time": 2865.8, "end_time": 2869.2}, {"text": "you are, in fact snubbing The Giver", "start_time": 2870.1, "end_time": 2873.1}, {"text": "Lilias Trotter was an up-and-coming artist in London with the latter half of the 19th century.", "start_time": 2878.0, "end_time": 2881.9}, {"text": "She had the prospect of an amazing career. She was discovered by a world-renowned art critic who took her under his wing and and actually told her that she would be the greatest artist who ever lived.", "start_time": 2883.6, "end_time": 2895.6}, {"text": "she pursued that for a while and then", "start_time": 2898.2, "end_time": 2900.6}, {"text": "the critic, basically told her you need to give everything, you are to your art, if you're going to be", "start_time": 2902.2, "end_time": 2911.4}, {"text": "What you can be?", "start_time": 2912.9, "end_time": 2913.7}, {"text": "Well, she was a believer.", "start_time": 2917.4, "end_time": 2919.3}, {"text": "She wrestled with that for some time.", "start_time": 2920.4, "end_time": 2921.9}, {"text": "And then she walked away from the idea of the prospect of being an artist.", "start_time": 2923.6, "end_time": 2927.8}, {"text": "And she wrote that, she said, I cannot give myself to painting and continue to seek first. The kingdom of God,", "start_time": 2931.3, "end_time": 2936.5}, {"text": "Type of working in the inner city of London for a Time, ministering to people, she decided that God had directed her, to Northern Africa, Algiers to be a missionary but no missions work with except at that time a female missionary. So she went on her own. She was undeterred, she went", "start_time": 2938.5, "end_time": 2956.1}, {"text": "She put the next 40 years of her life living in the northern part of the Sahara Desert dealing with these people.", "start_time": 2957.4, "end_time": 2966.1}, {"text": "Sharing with them, the light and life of Jesus Christ.", "start_time": 2967.4, "end_time": 2969.9}, {"text": "and for more than four decades,", "start_time": 2972.5, "end_time": 2974.6}, {"text": "she thoroughly enjoy life.", "start_time": 2976.1, "end_time": 2979.6}, {"text": "I don't know how you can enjoy life living in the Sahara desert, right? That doesn't make sense to me. She did she loved it.", "start_time": 2980.9, "end_time": 2987.6}, {"text": "During her time there, she wrote a poem, it became probably her most famous poem and a single line from that poem became the inspiration for him.", "start_time": 2989.6, "end_time": 2999.9}, {"text": "It really helps us find a perspective that we need.", "start_time": 3000.9, "end_time": 3003.7}, {"text": "The words go like this.", "start_time": 3005.5, "end_time": 3006.6}, {"text": "Oh Soul, are you weary and troubled?", "start_time": 3008.1, "end_time": 3010.8}, {"text": "No light in the darkness, you see?", "start_time": 3012.8, "end_time": 3014.7}, {"text": "There's light for a look at the savior.", "start_time": 3016.2, "end_time": 3019.0}, {"text": "And life more abundant and free.", "start_time": 3020.3, "end_time": 3024.0}, {"text": "If you know the chorus, sing it with me to Turn Your Eyes Upon, Jesus look for in his wonderful face and the Earth will grow straight change lead. And in the light of his glory and grace,", "start_time": 3026.0, "end_time": 3059.7}, {"text": "Brothers and sisters.", "start_time": 3062.3, "end_time": 3063.4}, {"text": "Put Christ in your view.", "start_time": 3066.0, "end_time": 3067.4}, {"text": "Look at God.", "start_time": 3069.0, "end_time": 3070.1}, {"text": "and when you do,", "start_time": 3071.3, "end_time": 3072.2}, {"text": "Things of this earth, grow strangely dim.", "start_time": 3074.0, "end_time": 3076.5}, {"text": "Why?", "start_time": 3077.6, "end_time": 3078.0}, {"text": "Because you're not looking to those things to give you meaning and purpose. You look at those things as just what they are.", "start_time": 3079.4, "end_time": 3085.7}, {"text": "And you enjoy them.", "start_time": 3087.7, "end_time": 3088.7}, {"text": "Because you were looking first and foremost.", "start_time": 3091.1, "end_time": 3093.6}, {"text": "Into the face of your creator.", "start_time": 3095.1, "end_time": 3096.6}, {"text": "The Giver of all good. Thanks.", "start_time": 3097.8, "end_time": 3100.2}, {"text": "Will you pray with me?", "start_time": 3101.2, "end_time": 3102.0}]